import Foundation

//https://baza-otvetov.ru/categories/view/1/180

//func getEasyQuestions()->[QuestionModel] {
//    var arr: [QuestionModel] = []
//    
//    var id = -1
//    var lev = 0
//    for i in 0...easyQuestions.count - 1 {
//        lev += 1
//        if lev > 12 {
//            lev = 0
//        }
//        let level = LevelEnum.allCases[lev]
//        let questionString = easyQuestions[i]
//        var answers = easyAnswers[i]
//        let trueAnswerText = answers.last!
//        answers.shuffle()
//        var indexOfTrue = 0
//        if let a = answers.firstIndex(of: trueAnswerText) {
//            indexOfTrue = Int(a)
//        }
//        
//        var trueOrFalse:[Bool] = [false, false, false, false]
//        trueOrFalse[indexOfTrue] = true
//        
//        let q = QuestionModel(id: id, levelEnum: level, question: questionString ,
//                              answers: [
//                                AnswerModel(questionId: id, answerId: "A", answerText: answers[0], isTrue: trueOrFalse[0]),
//                                AnswerModel(questionId: id, answerId: "B", answerText: answers[1], isTrue: trueOrFalse[1]),
//                                AnswerModel(questionId: id, answerId: "C", answerText: answers[2], isTrue: trueOrFalse[2]),
//                                AnswerModel(questionId: id, answerId: "D", answerText: answers[3], isTrue: trueOrFalse[3])
//            ],
//                              gameModeEnum: .easy,
//                              occupationEnum: .historian
//        )
//        arr.append(q)
//        id += 1
//    }
//    return arr
//}



let easyQuestions:[String] = [
    "Кого в старину на Руси называли вепрем?",
    "Кого в русских сказках называют Топтыгин?",
    "Какая хищная рыба стала героиней русской народной сказки?",
    "Для чего быку служат рога?",
    "Кого новосёлы, по нашей традиции, первым запускают в новый дом?",
    "Какую птицу называют «певцом русских полей»?",
    "Чем запасается российский бурый медведь перед зимним сном?",
    "Какое животное в Египте считается священным?",
    "Как летучие мыши определяют положение окружающих предметов?",
    "Как называется жилище волка?",
    "Разновидность какой из этих ящериц является крупнейшей в мире?",
    "Кто такой змееяд?",
    "Какое из этих животных может слышать самые высокие звуки?",
    "У какого из этих зверей самцы почти никогда сами не охотятся?",
    "Назовите родину волнистого попугая?",
    "Какое из этих животных не обитает на территории России?",
    "Кого солдат из сказки «Огниво» встретил на своём пути?",
    "Какого из этих животных не было среди Бременских музыкантов?",
    "У какого из этих героев в голове были одни опилки?",
    "Какой подарок ко дню рождения Сова подарила ослику Иа?",
    "Кого со страху проглотил Крокодил из стихотворения “Тараканище”?",
    "Что было нарисовано на холсте в коморке Папы Карло?",
    "На чем летал барон Мюнхгаузен?",
    "Что в русской сказке просила привезти купца его младшая дочь?",
    "Кого Винни-Пух тщетно уверял в том, что он не медведь, а туча?",
    "Где, по русским народным поверьям, живет кикимора?",
    "Как звали мальчика, выпустившего из бутылки старика Хоттабыча?",
    "Назовите фамилию почтальона из Простоквашино",
    "Куда от грязнули из Мойдодыра сиганула свечка?",
    "Какой породы рыбка оставила старуху у разбитого корыта?",
    "В каком городе жил Карлсон?",
    "В каком государстве жили герои многих русских сказок?",
    "Что усыпило Белоснежку?",
    "Сколько желаний старухи исполнила золотая рыбка?",
    "Кто дал Страшиле мозги, а Железному Дровосеку сердце?",
    "В русских сказках лисичка-сестричка, коза-дереза, а зайчик-... Кто?",
    "Где жил старик со своею старухой из сказки А.С. Пушкина 'Сказка о рыбаке и рыбке'?",
    "Какой рыболовной снастью ловил рыбу старик из сказки А.С. Пушкина 'Сказка о рыбаке и рыбке'?",
    "Где муха-цокотуха нашла денежку?",
    "Маленький мук из сказки был...?",
    "Чем промышлял Дуремар из сказки 'Золотой ключик'?",
    "Какой из этих цветов не относится к тёплым?",
    "За что тянул себя барон Мюнхгаузен, чтобы выбраться из тресины?",
    "В форме какого животного обычно делают копилки для монет?",
    "За какое время периода Земля оборачивается вокруг Солнца?",
    "У кого внешний покров состоит из хитина?",
    "С кем сравнивает себя находящийся в постоянных хлопотах человек?",
    "Сколько гномов было в сказке о Белоснежке?",
    "Летательный аппарат бабы Яги?",
    "Как звали девочку, которая жила в избушке медведя?",
    "Как звали гусениц - друзей Лунтика?",
    "Кто помог вытащить репку?",
    "Как звали девочку с голубыми волосами?",
    "Подвижный холм песка в пустыне называется…",
    "Что делали древние люди, чтобы вызвать дождь?",
    "Чего не может торнадо?",
    "В древности китайцы научились делать из коконов шелковичных червей…",
    "Где находится яд у кобры?",
    "Хвост какого животного похож на весло?",
    "Как приветствуют друг друга эскимосы?",
    "Какое насекомое скользит по воде и не тонет?",
    "Чтобы в загробной жизни фараон ни в чем не нуждался, в саркофаг вместе с мумией клали…",
    "Как называется помещение на судне, где живут матросы?",
    "Что образуется в раковинах устриц?",
    "Горячий источник, бьющий из-под земли, — это…",
    "Что использовали японцы вместо денег до появления монет?",
    "Раньше было модно носить вместо очков…",
    "Почему вода в море кажется синей?",
    "Какое растение хорошо переносит засуху?",
    "Кто помогал рыцарю облачаться в тяжелые доспехи?",
    "Что делали индейцы в знак примирения?",
    "Как называется место в пустыне, где есть вода и растительность?",
    "У кого из перечисленных животных самый острый слух?",
    "Колумб назвал жителей Америки индейцами, потому что…",
    "Где морская черепаха откладывает яйца?",
    "Стая каких рыб может за несколько минут уничтожить крупное животное?",
    "Какой прибор помогает изучать морское дно?",
    "В глубине болота образуется…",
    "Первобытные люди считали причиной болезней…",
    "Что из перечисленного было изобретено раньше?",
    "У какой рыбы оба глаза находятся на одной стороне туловища?",
    "Из чего делали первые самолеты?",
    "У какой птицы самое острое зрение?",
    "Это насекомое скатывает из навоза шарики",
    "Как называется повар на судне?",
    "Стекло делают …",
    "Моряки пропитывали свою одежду смолой…",
    "«Муравьиными коровами» называют…",
    "Пауки выделяют паутину…",
    "Какая птица может летать хвостом вперед?",
    "Какую форму принимает любая жидкость в невесомости?",
    "Русский космонавт А. Леонов первым…",
    "Какой длины язык у жирафа?",
    "Что в переводе с греческого означает слово «телефон»?",
    "Какой из этих органов не считается частью дыхательной системы?"
]



let easyAnswers: [[String]] = [
    ["Тигр", "Собака", "Кошка","Кабана"],
    ["Кабана", "Тигр", "Кошка", "Медведя"],
    ["Карась", "Акула", "Окунь", "Щука"],
    ["Копать землю", "Носить Еду", "Показывать коровам", "Нападать на врагов"],
    ["Собака", "Попугай", "Хомяк", "Кошка"],
    ["Соловей","Канарейка","Синица", "Жаворонок"],
    ["Ягодами и грибами","Медом","Ветками","Подкожным жиром"],
    ["Собака","Тигр","Змея","Кошка"],
    ["Глазами", "Обонянием", "Крыльями","Слухом"],
    ["Будка", "Берлога", "Дом","Логово"],
    ["Тегу", "Геккон", "Хамелеон", "Варан"],
    ["Ящерица", "Змея", "Рыба","Птица"],
    ["Собака", "Кошка", "Мышь", "Дельфин"],
    ["Обезьяны", "Ежы", "Тигры", "Львы"],
    ["Африка","Европа", "Америка", "Австралия"],
    ["Медведь", "Кабан", "Олень", "Лев"],
    ["Кощея-Бессмертного", "Короля", "Цервну-лягушку", "Старуху-ведьму"],
    ["Осла", "Петуха", "Кота","Козла"],
    ["Колобок", "Маленький Мук", "Карлсон", "Винни-Пух"],
    ["Шарик", "Морковку", "Горшочек с медом", "Хвост"],
    ["Комара", "Муху","Акулу", "Жабу"],
    ["Топор", "Буратино", "Помидор", "Котелок"],
    ["На облаке", "На ковре самолете", "На ракете", "На ядре"],
    ["Зеркальце", "Малахитовую шкатулку", "Золото", "Аленький цветочек"],
    ["Осла", "Сову", "Пяточка","Пчел"],
    ["В болоте", "В лесу", "Во дворе","В доме за печкой"],
    ["Женька", "Сашка", "Алеша", "Волька"],
    ["Дядя Федор", "Шарик", "Трубкин", "Печкин"],
    ["В шкаф","В колодец","На крышу","В печку"],
    ["Волшебная", "Серебряная", "Желтая", "Золотая"],
    ["Москва", "Париж", "Хельсинки", "Стокгольм"],
    ["Пятидесятом","Шестидесятом","Двухдесятом","Тридесятом"],
    ["Клубника", "Виноград", "Груша","Яблоко"],
    ["Одно", "Три","Два","Четыре"],
    ["Стелла", "Гингема", "Лев","Гудвин"],
    ["Попугайчик", "Петляйчик", "Обгрызайчик", "Побегайчик"],
    ["в избушке", "в лачужке", "в шалаше", "в землянке"],
    ["Удочкой", "Бреднем", "Сачком", "Невод"],
    ["На лугу", "В лесу", "Во дворе", "В поле"],
    ["Ребенком", "Лиллипутом", "Подростком", "Карликом"],
    ["Лягушками", "Бабочками", "Стрекозами", "Пиявками"],
    ["Оранжевый", "Коричневый", "Красный", "Синий"],
    ["за ухо", "за язык", "за голову", "за волосы"],
    ["Корова", "Броненосец","Собака", "Свинья"],
    ["За месяц", "За неделю", "За год", "За сутки"],
    ["Рыбы", "Птицы", "Млекопитающие", "Членистоногие"],
    ["С пауком в банке", "С белкой в колесе", "С птицей в клетке", "С белкой в колесе"],
    ["12", "6", "8", "7"],
    ["Ковер-Самолет", "Метла", "Ступа", "Облако"],
    ["Даша", "Наташа", "Аленушка", "Маша"],
    ["Спанч Боб и Патрик", "Марио и Луиджи", "Карл и Джек", "Вупсень и Пупсень"],
    ["Дед", "Бабка", "Внучка", "Мышка"],
    ["Малина", "Аленушка","Герда", "Мальвина"],
    ["Утес", "Скала", "Гора","Дюна"],
    ["Три дня ничего не ели", "Убивали мамонта", "Ходили с зонтиком и говорили «кажется, дождь начинается…»","Танцевали вокруг костра с бубном в руках"],
    ["Поднять в воздух автомобиль", "Вырвать с корнями дерево","Разрушить здание", "Стоять на месте"],
    ["Приправу", "Бумагу", "Резину","Шелк"],
    ["На кончике языка", "На хвосте", "В капюшоне", "В зубе"],
    ["Белки", "Лисы", "Медведя","Бобра"],
    ["Пожимают руки", "Целуются", "Обнимаются","Трутся носами"],
    ["Божья коровка", "Подёнка", "Стрекоза", "Водомерка"],
    ["Продукты", "Папирус", "Плюшевого мишку", "Драгоценности"],
    ["Келья", "Квартира", "Кабинет", "Кубрик"],
    ["Кораллы", "Золото", "Алмазы", "Жемчуг"],
    ["Фонтан", "Водопад", "Ручей", "Гейзер"],
    ["Картофель", "Жемчужины", "Ракушки", "Рис и ткани"],
    ["Микроскоп", "Бинокль", "Телескоп", "Монокль"],
    ["Из-за водорослей", "Из-за цвета дна", "Из-за растворенной соли", "Вода отражает небо"],
    ["Грейпфрут", "Пальма", "Береза", "Кактус"],
    ["Кучер", "Дворецкий", "Лакей", "Оруженосец"],
    ["Ломали все стрелы", "Хлопали в ладоши", "Втыкали копья в деревья", "Закапывали топор войны"],
    ["Пальмовая роща", "Рай", "Мираж", "Оазис"],
    ["У кошки", "У ежа", "У летучей мыши", "У собаки"],
    ["Ему нравилось это слово", "Туземцы выращивали индюков", "Туземцы подарили ему индейку", "Он думал, что приплыл в Индию"],
    ["В лесной чаще", "На лугу", "На дне океана", "В песке на берегу"],
    ["Карасей", "Карпов", "Морских коньков", "Пираний"],
    ["Телескоп", "Дирижабль", "Луноход", "Батискаф"],
    ["Соль", "Железо", "Золото", "Торф"],
    ["Вирусы", "Сквозняки", "Грязные руки", "Злых духов"],
    ["Компьютер", "Принтер", "Копировальный аппарат", "Печатная машинка"],
    ["У окуня", "У акулы", "У форели", "У камбалы"],
    ["Из резины", "Из пластмассы", "Из металла", "Из дерева"],
    ["У дятла", "У ворона", "У скворца", "У орла"],
    ["Термит", "Майский жук", "Таракан", "Скарабей"],
    ["Канонир", "Квартирмейстер", "Боцман", "Кок"],
    ["Из пластмассы", "Из железной руды", "Из камней", "Из песка"],
    ["Для утепления", "Чтобы она не рвалась", "Чтобы в ней не заводились насекомые", "Чтобы она не пропускала воду"],
    ["Гусениц", "Медведок", "Кузнечиков", "Тлю"],
    ["Из задних лапок", "Из передних лапок", "Из челюстей", "Из брюшка"],
    ["Тукан", "Попугай", "Нанду", "Колибри"],
    ["Форму куба", "Овальную форму", "Остается бесформенной", "Форму шара"],
    ["Спустился в шахту", "Ступил на поверхность Луны", "Высадился на Марс", "Вышел в открытый космос"],
    ["Метр", "20 сантиметров", "2 метра", "Полметра"],
    ["Плохо слышно", "Привет", "Давай поговорим", "Далекий звук"],
]




func getProfiles() -> [ProfileModel] {
    return [
        ProfileModel(id: 0, name: "New", fakeProfile: true, age: 15, ava: URL(string: "unknown-ava.png")!)
    ]
}


func getTemplateProfile() -> TemplateProfileModel {
    return TemplateProfileModel(avaURLs: [URL(string: "ava1.png")!, URL(string: "ava2.png")!, URL(string: "ava3.png")!, URL(string: "ava4.png")!,URL(string: "ava5.png")!, URL(string: "ava6.png")!, URL(string: "ava7.png")!, URL(string: "ava8.png")!, URL(string: "ava9.png")!, URL(string: "ava10.png")!],
                                miniAvaURLs: [URL(string: "ava1.png")!, URL(string: "ava2.png")!, URL(string: "ava3.png")!, URL(string: "ava4.png")!,URL(string: "ava5.png")!, URL(string: "ava6.png")!, URL(string: "ava7.png")!, URL(string: "ava8.png")!, URL(string: "ava8.png")!, URL(string: "ava10.png")!]
    )
}
