import Foundation


func getMediumQuestions()->[QuestionModel] {
    var arr: [QuestionModel] = []
    
    var id = -1
    var lev = 0
    for i in 0...easyQuestions.count - 1 {
        lev += 1
        if lev > 12 {
            lev = 0
        }
        let level = LevelEnum.allCases[lev]
        let questionString = easyQuestions[i]
        var answers = easyAnswers[i]
        let trueAnswerText = answers.last!
        answers.shuffle()
        var indexOfTrue = 0
        if let a = answers.firstIndex(of: trueAnswerText) {
            indexOfTrue = Int(a)
        }
        
        var trueOrFalse:[Bool] = [false, false, false, false]
        trueOrFalse[indexOfTrue] = true
        
        let q = QuestionModel(id: id, levelEnum: level, question: questionString ,
                              answers: [
                                AnswerModel(questionId: id, answerId: "A", answerText: answers[0], isTrue: trueOrFalse[0]),
                                AnswerModel(questionId: id, answerId: "B", answerText: answers[1], isTrue: trueOrFalse[1]),
                                AnswerModel(questionId: id, answerId: "C", answerText: answers[2], isTrue: trueOrFalse[2]),
                                AnswerModel(questionId: id, answerId: "D", answerText: answers[3], isTrue: trueOrFalse[3])
            ],
                              gameModeEnum: .medium,
                              occupationEnum: .historian
        )
        arr.append(q)
        id += 1
    }
    return arr
}



let mediumQuestions:[String] = [
    "Подвижный холм песка в пустыне называется…",
    "Что делали древние люди, чтобы вызвать дождь?",
    "Чего не может торнадо?",
    "В древности китайцы научились делать из коконов шелковичных червей…",
    "Где находится яд у кобры?",
    "Хвост какого животного похож на весло?",
    "Как приветствуют друг друга эскимосы?",
    "Какое насекомое скользит по воде и не тонет?",
    "Чтобы в загробной жизни фараон ни в чем не нуждался, в саркофаг вместе с мумией клали…",
    "Как называется помещение на судне, где живут матросы?",
    "Что образуется в раковинах устриц?",
    "Горячий источник, бьющий из-под земли, — это…",
    "Что использовали японцы вместо денег до появления монет?",
    "Раньше было модно носить вместо очков…",
    "Почему вода в море кажется синей?",
    "Какое растение хорошо переносит засуху?",
    "Кто помогал рыцарю облачаться в тяжелые доспехи?",
    "Что делали индейцы в знак примирения?",
    "Как называется место в пустыне, где есть вода и растительность?",
    "У кого из перечисленных животных самый острый слух?",
    "Колумб назвал жителей Америки индейцами, потому что…",
    "Где морская черепаха откладывает яйца?",
    "Стая каких рыб может за несколько минут уничтожить крупное животное?",
    "Какой прибор помогает изучать морское дно?",
    "В глубине болота образуется…",
    "Первобытные люди считали причиной болезней…",
    "Что из перечисленного было изобретено раньше?",
    "У какой рыбы оба глаза находятся на одной стороне туловища?",
    "Из чего делали первые самолеты?",
    "У какой птицы самое острое зрение?",
    "Это насекомое скатывает из навоза шарики",
    "Как называется повар на судне?",
    "Стекло делают …",
    "Моряки пропитывали свою одежду смолой…",
    "«Муравьиными коровами» называют…",
    "Пауки выделяют паутину…",
    "Какая птица может летать хвостом вперед?",
    "Какую форму принимает любая жидкость в невесомости?",
    "Что в переводе с греческого означает слово «телефон»?",
    
]



let mediumAnswers: [[String]] = [
    ["Утес", "Скала", "Гора","Дюна"],
    ["Три дня ничего не ели", "Убивали мамонта", "Ходили с зонтиком и говорили «кажется, дождь начинается…»","Танцевали вокруг костра с бубном в руках"],
    ["Поднять в воздух автомобиль", "Вырвать с корнями дерево","Разрушить здание", "Стоять на месте"],
    ["Приправу", "Бумагу", "Резину","Шелк"],
    ["На кончике языка", "На хвосте", "В капюшоне", "В зубе"],
    ["Белки", "Лисы", "Медведя","Бобра"],
    ["Пожимают руки", "Целуются", "Обнимаются","Трутся носами"],
    ["Божья коровка", "Подёнка", "Стрекоза", "Водомерка"],
    ["Продукты", "Папирус", "Плюшевого мишку", "Драгоценности"],
    ["Келья", "Квартира", "Кабинет", "Кубрик"],
    ["Кораллы", "Золото", "Алмазы", "Жемчуг"],
    ["Фонтан", "Водопад", "Ручей", "Гейзер"],
     ["Картофель", "Жемчужины", "Ракушки", "Рис и ткани"],
     ["Микроскоп", "Бинокль", "Телескоп", "Монокль"],
 ["Из-за водорослей", "Из-за цвета дна", "Вода отражает небо", "Из-за растворенной соли"],
     ["Микроскоп", "Бинокль", "Телескоп", "Монокль"],
 
     ["Грейпфрут", "Пальма", "Береза", "Кактус"],
    
     ["Кучер", "Дворецкий", "Лакей", "Оруженосец"],
      ["Ломали все стрелы", "Хлопали в ладоши", "Втыкали копья в деревья", "Закапывали топор войны"],
["Пальмовая роща", "Рай", "Мираж", "Оазис"],
     ["У кошки", "У ежа", "У летучей мыши", "У собаки"],
     ["Ему нравилось это слово", "Туземцы выращивали индюков", "Туземцы подарили ему индейку", "Он думал, что приплыл в Индию"],
     ["В лесной чаще", "На лугу", "На дне океана", "В песке на берегу"],
     ["Карасей", "Карпов", "Морских коньков", "Пираний"],
     ["Телескоп", "Дирижабль", "Луноход", "Батискаф"],
     
     ["Соль", "Железо", "Золото", "Торф"],
     
     ["Вирусы", "Сквозняки", "Грязные руки", "Злых духов"],
     ["Компьютер", "Принтер", "Копировальный аппарат", "Печатная машинка"],
     
      ["У окуня", "У акулы", "У форели", "У камбалы"],
     ["Из резины", "Из пластмассы", "Из металла", "Из дерева"],
     
      ["У дятла", "У ворона", "У скворца", "У орла"],
    ["Термит", "Майский жук", "Таракан", "Скарабей"],

    
    ["Канонир", "Квартирмейстер", "Боцман", "Кок"],
    
     ["Из пластмассы", "Из железной руды", "Из камней", "Из песка"],
     
     
     ["Для утепления", "Чтобы она не рвалась", "Чтобы в ней не заводились насекомые", "Чтобы она не пропускала воду"],
     
     
     ["Гусениц", "Медведок", "Кузнечиков", "Тлю"],
     
     ["Из задних лапок", "Из передних лапок", "Из челюстей", "Из брюшка"],
     
     
     ["Тукан", "Попугай", "Нанду", "Колибри"],
     
     ["Форму куба", "Овальную форму", "Остается бесформенной", "Форму шара"],
     ["Плохо слышно", "Привет", "Давай поговорим", "Далекий звук"],
]
