//
//  CreateDifficultQuestions.swift
//  ToBeMillionare
//
//  Created by Igor Ivanov on 20.06.2020.
//  Copyright © 2020 Igor Ivanov. All rights reserved.
//

import Foundation



func getDiffQuestions()->[QuestionModel] {
    var arr: [QuestionModel] = []
    
    var id = -1
    for question in hardQuestions {
        
        var answers = [question.falseAnswer1, question.falseAnswer2, question.falseAnswer3, question.trueAnswer]
        let trueAnswerText = answers.last!
        answers.shuffle()
        var indexOfTrue = 0
        if let a = answers.firstIndex(of: trueAnswerText) {
            indexOfTrue = Int(a)
        }
        
        var trueOrFalse:[Bool] = [false, false, false, false]
        trueOrFalse[indexOfTrue] = true
        
        let q = QuestionModel(id: id, minLevelEnum: question.minLevelEnum,maxLevelEnum: question.maxLevelEnum, question: question.question ,
                              answers: [
                                AnswerModel(questionId: id, answerId: "A", answerText: answers[0], isTrue: trueOrFalse[0]),
                                AnswerModel(questionId: id, answerId: "B", answerText: answers[1], isTrue: trueOrFalse[1]),
                                AnswerModel(questionId: id, answerId: "C", answerText: answers[2], isTrue: trueOrFalse[2]),
                                AnswerModel(questionId: id, answerId: "D", answerText: answers[3], isTrue: trueOrFalse[3])
            ],
                              gameModeEnum: .easy,
                              occupationEnum: question.occupation
        )
        arr.append(q)
        id += 1
    }
    return arr
}


struct Question {
    var question: String = ""
    var occupation: OccupationEnum = .biologist
    var falseAnswer1: String = ""
    var falseAnswer2: String = ""
    var falseAnswer3: String = ""
    var trueAnswer: String = ""
    var minLevelEnum: LevelEnum = .level1
    var maxLevelEnum: LevelEnum = .level1
    
    init(_ question: String,
         _ occupation: OccupationEnum,
         _ falseAnswer1: String,
         _ falseAnswer2: String,
         _ falseAnswer3: String,
         _ trueAnswer: String,
         _ minLevelEnum: LevelEnum = .level11,
         _ maxLevelEnum: LevelEnum = .level13) {
        
        self.question = question + "   " + maxLevelEnum.rawValue
        self.occupation = occupation
        self.falseAnswer1 = falseAnswer1
        self.falseAnswer2 = falseAnswer2
        self.falseAnswer3 = falseAnswer3
        self.trueAnswer = trueAnswer
        self.minLevelEnum = minLevelEnum
        self.maxLevelEnum = maxLevelEnum
    }
}


let hardQuestions:[Question] = [
    
    Question("Про какую летнюю погоду говорят 'Вёдро' ?",OccupationEnum.litterateur,
             "Теплая дождливая", "Прохладная дождливая", "Длительные заморозки","Сухая ясная", .level1, .level4),
    
    Question("Какое брюхо, согласно спорной русской пословице, глухо к ученью?",OccupationEnum.litterateur,
             "Толстое", "Тощее","Пустое", "Сытое", .level1, .level4),
    
    Question("Благодаря какому животному Шурик познакомился с Ниной в к/ф 'Кавказская пленница'?",OccupationEnum.housewife,
             "Верблюд", "Конь","Ежик", "Осел", .level1, .level4),
    
    Question("Кто из этих знаменитых людей не является тезкой остальных?",OccupationEnum.historian,
             "Боярский", "Лермонтов", "Горбачев", "Лужков", .level1, .level4),
    
    Question("У кого из 'вампиров' кровь пьют только самки?",OccupationEnum.biologist,
             "Летучие мыши", "Пиявки", "Клещи","Комары", .level1, .level4),
    
    Question("Заячьей картошкой в народе называют",OccupationEnum.biologist,
             "Морковь", "Капусту", "Кору деревьев", "Гриб дождевик", .level1, .level4),
    
    Question("Какую позицию на поле называют 'голкипер'?",OccupationEnum.sportReviewer,
             "Защитник", "Полузащитник", "Нападающий", "Вратарь", .level1, .level4),
    
    Question("Официальный язык государства Израиль?",OccupationEnum.historian,
             "Фарси", "Русский", "Арабский", "Иврит", .level1, .level4),
    
    Question("В артериях кровь движется...?",OccupationEnum.biologist,
             "Сверху вниз", "От органов к сердцу", "Снизу вверх", "От сердца к органам", .level1, .level4),
    
    Question("От какого дерева появляются желуди?",OccupationEnum.biologist,
             "Каштан", "Ясень", "Клен", "Дуб", .level1, .level4),
    
    Question("Корюшка - это...",OccupationEnum.biologist,
             "Птичка", "Крючок", "Растение", "Рыбка", .level1, .level4),
    
    Question("В каком итальянском городе была выведена известная порода комнатных собак?",OccupationEnum.historian,
             "Сиракуза", "Падуя","Венеция", "Болонья", .level1, .level4),
    
    Question("Какой буквой физики обозначают ускорение свободного падения?",OccupationEnum.mathematician,
             "f", "n", "m", "g", .level1, .level4),
    
    Question("Игроков какой команды называют 'армейцами'",OccupationEnum.sportReviewer,
             "Динамо", "Спартак", "Локомотив", "ЦСКА", .level1, .level4),
    
    Question("Сказочный Доктор?",OccupationEnum.litterateur,
             "Окулист", "Фельдшер", "Медик ", "Айболит", .level1, .level4),
    
    Question("Что не является кисломолочным продуктом?",OccupationEnum.biologist,
             "Сыр", "Сметана", "Творог", "Майонез", .level1, .level4),
    
    Question("Как заканчивается выражение 'Врет как...'?",OccupationEnum.litterateur,
             "Зеленый змий", "Розовый слон", "Серый заяц", "Сивый мерин", .level1, .level4),
    
    Question("Какое устройство применяли во время инквизиции?",OccupationEnum.historian,
             "португальский башмак", "японские гета", "русский валенок", "испанский сапог", .level1, .level4),
    
    Question("Как по-научному называется питьевой спирт?",OccupationEnum.biologist,
             "Метанол", "Политура", "Микстура", "Этанол", .level1, .level4),
    
    Question("Назовите вслед за Н. В. Гоголем вторую беду России, кроме дорог ?",OccupationEnum.litterateur,
             "Умники", "Пьяницы", "Олигархи", "Дураки", .level1, .level4),
    
    Question("Что у моряков называется камбузом?",OccupationEnum.erudite,
             "Машинное отделение", "Мостик капитана", "Кладовая", "Кухня", .level1, .level4),
    
    Question("Как звали знаменитого мореплавателя Кука?",OccupationEnum.historian,
             "Томас", "Джон", "Джозеф", "Джеймс", .level1, .level4),
    
    Question("Как называется надпись на лицевой или оборотной стороне монеты, медали?",OccupationEnum.erudite,
             "Гурт", "Поясниловка", "Номинал", "Легенда", .level1, .level4),
    
    Question("Какой пистолет Остап Бендер обещал дать Кислярскому в романе «Двенадцать стульев»?",OccupationEnum.litterateur,
             "наган", "маузер", "браунинг", "парабеллум", .level1, .level4),
    
    Question("Кого иногда называют спрутом?",OccupationEnum.biologist,
             "кашалота", "медузу", "каракатицу", "осьминога", .level1, .level4),
    
    Question("В честь кого получил своё имя популярный салат «Цезарь»?",OccupationEnum.historian,
             "птицы цесарки", "Чезаре Борджиа", "Юлия Цезаря", "повара — создателя салата", .level1, .level4),
    
    Question("Что, по мнению Веры из к/ф 'Служебный роман', делает женщину женщиной?",OccupationEnum.housewife,
             "Прическа", "Обувь", "Макияж", "Обувь", .level1, .level4),
    
    Question("Как называется самый многочисленный отряд млекопитающих?",OccupationEnum.biologist,
             "хищные", "кошачьи", "приматы", "грызуны", .level1, .level4),
    
    Question("Как называется боковая часть пистолета?",OccupationEnum.erudite,
             "Лоб", "Спина", "Затылок", "Щека", .level1, .level4),
    
    Question("Какой художник рисует животных?",OccupationEnum.litterateur,
             "баталист", "маринист", "пейзажист", "анималист", .level1, .level4),
    
    Question("К какому классу относится большинство известных видов животных?",OccupationEnum.biologist,
             "Млекопитающие", "Рыбы", "Птицы", "Насекомые", .level1, .level4),
    
    Question("Название какого животного с греческого переводится как 'водяная лошадь'?",OccupationEnum.biologist,
             "Носорог", "Утконос", "Ламантин", "Гиппопотам", .level1, .level4),
    
    Question("К каким обезьянам относился Пират. сыгравший в фильме «Полосатый рейс»?",OccupationEnum.housewife,
             "Мартышки", "Макаки", "Павианы", "Шимпанзе", .level1, .level4),
    
    Question("Что придумала маркиза де Помпадур, чтобы казаться выше?",OccupationEnum.litterateur,
             "Сережки", "Лестницу", "Ходули", "Туфли на высоком каблуке", .level1, .level4),
    
    Question("Что вставляют в степлер?",OccupationEnum.erudite,
             "патроны", "ядра", "снаряды", "скобы", .level1, .level4),
    
    Question("Что планирует человек, собирающийся «залечь на дно»?",OccupationEnum.erudite,
             "пойти на рыбалку", "заняться дайвингом", "утопиться", "спрятаться и затаиться", .level1, .level4),
    
    Question("Откуда все мы вышли, если верить если верить песне «Смело, товарищи, в ногу!»?",OccupationEnum.litterateur,
             "из гоголевской шинели", "из отряда приматов", "из вагона", "из народа", .level1, .level4),
    
    Question("У кого в гостях Винни-Пух попал в безвыходное положение?",OccupationEnum.litterateur,
             "у Пятачка", "у Совы", "у ослика Иа-Иа", "у Кролика", .level1, .level4),
    
    Question("Что означает аббревиатура «имхо», которая часто встречается в интернет-общении?",OccupationEnum.litterateur,
             "вопреки вышеизложенному", "несмотря на авторитеты", "уточняя подробности", "по моему мнению", .level1, .level4),
    
    Question("Как закончить строчку стихотворения Маяковского: «Двое в комнате. Я и…»?",OccupationEnum.litterateur,
             "лень", "Лиля", "Леннон", "Ленин", .level1, .level4),
    
    Question("Что отдыхающий использует на пляже?",OccupationEnum.housewife,
             "стояк", "армяк", "товарняк", "лежак", .level1, .level4),
    
    Question("Чем, как говорят, поросло то, что стерлось из памяти?",OccupationEnum.housewife,
             "бельем", "сырьем", "старьем", "быльем", .level1, .level4),
    
    Question("Какой вопрос обычно задает ведущий аукциона?",OccupationEnum.erudite,
             "Кто меньше?", "Кто следующий?", "Кто последний?", "Кто больше?", .level1, .level4),
    
    Question("Монахи какого ордена носили рясы, цвет которых в 18 веке дал название кофейному напитку?",OccupationEnum.historian,
             "доминиканцы", "францисканцы", "иезуиты", "капуцины", .level1, .level4),
    
    Question("На чем поднялся Винни-Пух к пчелам?",OccupationEnum.housewife,
             "на самолете", "на вертолете", "залез на дерево", "на воздушном шарике", .level1, .level4),
    
    Question("Дело какой части света является 'тонким'?",OccupationEnum.housewife,
             "Запад", "Север", "Юг", "Восток", .level1, .level4),
    
    Question("Каким прибором в сердцах называет свой грузовик водитель Эдик из 'Кавказской пленницы'?",OccupationEnum.housewife,
             "Телевизором", "Вентилятором", "Утюгом", "Пылесосом", .level1, .level4),
    
    Question("Какое имя можно дать рассеянному, забывчивому человеку?",OccupationEnum.housewife,
             "Иван Иваныч", "Петр Петрович", "Сидор Сидорович", "Семен Семеныч", .level1, .level4),
    
    Question("Описание работы какого прибора надиктовывал Костя Дубу из новеллы 'Наваждение' в одном известном фильме?",OccupationEnum.housewife,
             "Синхроциклотрон", "Синхронуклотрон", "Синхротрон", "Синхрофазотрон", .level1, .level4),
    
    Question("Какую кашу предлагал Бэрримор сэру Генри в 'Собаке Баскервилей'?",OccupationEnum.housewife,
             "Гречневую", "Пшенную", "Манную", "Овсяную", .level1, .level4),
    
    Question("Какая икра считалась самой ценной и недоступной в фильме 'Иван Васильевич меняет профессию'?",OccupationEnum.housewife,
             "Черная", "Щучья", "Красная", "Баклажановая", .level1, .level4),
    
    Question("Как звали «кавказскую пленницу»?",OccupationEnum.housewife,
             "Марина", "Наташа", "Эллочка", "Нина", .level1, .level4),
    
    Question("Назовите фамилию главного героя фильма 'Ирония судьбы, или с легким паром'",OccupationEnum.housewife,
             "Фукашин", "Барашин", "Пьяншин", "Лукашин", .level1, .level4),
    
    Question("Как называлась банда, с которой боролись герои фильма 'Место встречи изменить нельзя'?",OccupationEnum.housewife,
             "Белый тигр", "Красный лев", "Золотой лев", "Чёрная кошка", .level1, .level4),
    
    Question("Сотрудниками какой структуры являлись главные герои фильма 'Место встречи изменить нельзя'?",OccupationEnum.housewife,
             "СМЕРШ", "НКВД", "ФСБ", "КГБ", .level1, .level4),
    
    Question("Как звали возлюбленную Шарапова фильма 'Место встречи изменить нельзя'?",OccupationEnum.housewife,
             "Маша", "Светка", "Даша", "Варя", .level1, .level4),
    
    Question("Какое было прозвище у вора-рецедивиста Валентина Бисяева фильма 'Место встречи изменить нельзя'?",OccupationEnum.housewife,
             "Пашка-Тушёный", "Валька-Копчёный", "Сашка-Припаренный", "Сашка-Пожаренный", .level1, .level4),
    
    Question("Кто из трёх мушкетеров исполняет песню, которая начинается со слов «Хоть Бог и запретил дуэли, но к шпаге чувствую талант.»?",OccupationEnum.housewife,
             "Арамис", "Партос", "Д’Артаньян", "Атос", .level1, .level4),
    
    Question("Кто по мнению Д’Артаньяна постоянно исчезает?",OccupationEnum.housewife,
             "Миледи", "Арамис", "Партос", "Констанция", .level1, .level4),
    
    Question("В каком советском фильме прозвучала фраза: «За чужой счет пьют язвенники и трезвенники»?",OccupationEnum.housewife,
             "Операция Ы", "Иван Васильевич меняет профессию", "Сибирский Цирюльник", "Бриллиантовая рука", .level1, .level4),
    
    Question("Кто главный герой фильма «Белое солнце пустыни»?",OccupationEnum.housewife,
             "Колчак", "Чапаев", "Петруха", "Сухов", .level1, .level4),
    
    Question("Кто главный отрицательный персонаж фильма «Белое солнце пустыни»?",OccupationEnum.housewife,
             "Колчак", "Троцкий", "Саид", "Чёрный Абдулла", .level1, .level4),
    
    Question("В какую эпоху попадают Иван Васильевич Бунша и вор-рецидивист Жорж Милославский?",OccupationEnum.housewife,
             "Василия II Васильевича Тёмного", "Бориса Фёдоровича Годунова", "Владимира Владимировича Путина", "Ивана IV Васильевича Грозного", .level1, .level4),
    
    Question("Кто был возлюбленным жены Шурика?",OccupationEnum.housewife,
             "Стоматолог Антон Семёнович Шпак", "Вор-рецидивист Жорж Милославский", "Иван Васильевич Бунша", "Кинорежиссёр Якин", .level1, .level4),
    
    Question("С кем заигрывал во время банкета в царских палатах Иван Васильевич Бунша?",OccupationEnum.housewife,
             "С Ульяной Андреевной", "С Зиночкой", "С Екатериной Великой", "С Марфой Васильевной", .level1, .level4),
    
    Question("Какое количество курток было украдено у Шпака Антона Семёновича?",OccupationEnum.housewife,
             "Две", "Одна", "Ни одной", "Три", .level1, .level4),
    
    Question("Какая фамилия у главного героя, «примерного семьянина» Василия фильма «Любовь и Голуби»?",OccupationEnum.housewife,
             "Кузнецов", "Кузин", "Кузькин", "Кузякин", .level1, .level4),
    
    Question("Кого Абдулла оставил в крепости при побеге в фильме «Белое солнце пустыни»?",OccupationEnum.housewife,
             "Своих родителей", "Своих братьев", "Петруху", "Своих жён", .level1, .level4),
    
    Question("Какое выражение часто можно услышать от Василия в фильме «Любовь и Голуби»?",OccupationEnum.housewife,
             "Едрид-мадрид", "Едрён батон", "ЕПРСТ", "Ёшкин кот", .level1, .level4),
    
    Question("Сколько серий в фильме «Большая перемена»?",OccupationEnum.housewife,
             "1", "2", "3", "4", .level1, .level4),
    
    Question("Кто из героев попал в милицию на 15 суток за «издевательство над человеком» в фильме «Большая перемена»?",OccupationEnum.housewife,
             "Степан Семёнович Леднёв", "Генка Ляпишев", "Отто Фукин", "Григорий Ганжа", .level1, .level4),
    
    Question("Как назывались категории инопланетян, но которые делилось их общество в фильме «Кин-дза-дза!»?",OccupationEnum.housewife,
             "Чутлаки и пицанет", "Чутлаки и пицанет", "Олигархи и все остальные", "Чатлаки и пацане", .level1, .level4),
    
    Question("Как назывался узел, необходимый для межзвездных полетов в фильме «Кин-дза-дза!»?",OccupationEnum.housewife,
             "Гравицука", "Гравитлана", "Гравицатка", "Гравицапа", .level1, .level4),
    
    Question("Как следует хранить молоко, чтобы они не теряло ценные витамины?",OccupationEnum.housewife,
             "В холоде", "На свету", "В тепле", "В темноте", .level1, .level4),
    
    Question("Какой водой лучше смывать молоко?",OccupationEnum.housewife,
             "Горячей", "Комнатной температуры", "Любой", "Холодной", .level1, .level4),
    
    Question("Какой эффект, как говорят, производит покупка дорогой вещи?",OccupationEnum.housewife,
             "щёлкает по барсетке", "стреляет по кошельку", "шлёпает по кредитке", "бьёт по карману", .level1, .level4),
    
    Question("Как заканчивался лозунг эпохи социализма: 'Нынешнее поколение советских людей будет жить...'?",OccupationEnum.housewife,
             "не тужить", "долго и счастливо", "на Марсе", "при коммунизме", .level1, .level4),
    
    Question("На что, согласно законам физики, действует подъёмная сила?",OccupationEnum.housewife,
             "крюк башенного крана", "звонок будильника", "рост производства", "крыло самолёта", .level1, .level4),
    
    Question("Как называется склад имущества в воинской части?",OccupationEnum.housewife,
             "жаровня", "парилка", "сушилка", "каптёрка", .level1, .level4),
    
    Question("Какую часть имбиря чаще всего используют в кулинарии?",OccupationEnum.housewife,
             "листья", "стебель", "цветок", "корень", .level1, .level4),
    
    Question("Сколько миллиметров в километре?",OccupationEnum.housewife,
             "десять тысяч", "сто тысяч", "десять миллионов", "миллион", .level1, .level4),
    
    Question("Куда во время чаепития обычно кладут варенье?",OccupationEnum.housewife,
             "в штепсель", "в удлинитель", "в тройник", "в розетку", .level1, .level4),
    
    Question("Какую карточную масть часто называют 'сердечками'?",OccupationEnum.housewife,
             "пики", "трефы", "бубны", "червы", .level1, .level4),
    
    Question("Какими бывают хранилища данных в Интернете?",OccupationEnum.housewife,
             "тучными", "дождевыми", "радужными", "облачными", .level1, .level4),
    
    Question("Во что жидкость обычно не наливают?",OccupationEnum.housewife,
             "в реторту", "в бурдюк", "в анкерок", "в тубус", .level1, .level4),
    
    Question("Какое блюдо туристы готовят в золе костра?",OccupationEnum.housewife,
             "макароны во фраке", "селёдка под шубой", "рис в кимоно", "картошка в мундире", .level1, .level4),
    
    Question("Что обычно не сообщают всем авиапассажирам на борту лайнера?",OccupationEnum.housewife,
             "высоту полёта", "температуру в месте посадки", "продолжительность полёта", "номер телефона стюардессы", .level1, .level4),
    
    Question("Как называется фон рабочего стола компьютера?",OccupationEnum.housewife,
             "ковёр", "паркет", "гобелен", "обои", .level1, .level4),
    
    Question("Кто такой Берендей из русских народных сказок?",OccupationEnum.housewife,
             "боярин", "леший", "конь", "царь", .level1, .level4),
    
    Question("Как называется стеклянная оболочка лампы накаливания?",OccupationEnum.housewife,
             "ампула", "пробирка", "реторта", "колба", .level1, .level4),
    
    Question("О чём говорят: 'Ни свет ни заря'?",OccupationEnum.housewife,
             "о потухшем костре", "о закончившемся фейерверке", "о перегоревших пробках", "о раннем утре", .level1, .level4),
    
    Question("Какой подарок обнаружили у стен города защитники Трои?",OccupationEnum.housewife,
             "пятьсот эскимо", "колечко", "миллион алых роз", "коня", .level1, .level4),
    
    Question("Как называется парная артерия в теле человека?",OccupationEnum.housewife,
             "спящая", "бодрствующая", "бессонная", "сонная", .level1, .level4),
    
    Question("Как называется нижняя часть утюга?",OccupationEnum.housewife,
             "шнурок", "язычок", "каблук", "подошва", .level1, .level4),
    
    Question("Куда собирался сесть медведь, чтобы съесть пирожок, испеченный Машей?",OccupationEnum.housewife,
             "на пол", "на диету", "на велосипед", "на пенек", .level1, .level4),
    
    Question("Что из перечисленного название не только фильма, но и детской забавы?",OccupationEnum.housewife,
             "Принцесса цирка", "Королева бензоколонки", "Генералы песчаных карьеров", "Царь горы", .level1, .level4),
    
    Question("Какого события не было в истории здания, занимаемого сейчас мэрией Москвы?",OccupationEnum.housewife,
             "его передвинули", "его надстроили", "оно пострадало от огня", "на него упала бомба", .level1, .level4),
    
    Question("Какой танец не относится к программе спортивных бальных танцев?",OccupationEnum.housewife,
             "самба", "румба", "джайв", "капоэйра", .level1, .level4),
    
    Question("Как называют человека, пользующегося благосклонностью влиятельного лица?",OccupationEnum.housewife,
             "эрудит", "космополит", "троглодит", "фаворит", .level1, .level4),
    
    Question("Во что бьет судья-хронометрист, подавая сигнал об окончания боксерского раунда?",OccupationEnum.housewife,
             "бубен", "литавры", "барабан", "гонг", .level1, .level4),
    
    Question("Бутерброд с чем неправильно, по мнению кота Матроскина, ел дядя Фёдор?",OccupationEnum.housewife,
             "с сыром", "с красной рыбой", "с черной икрой", "с колбасой", .level1, .level4),
    
    Question("Как называется один из подвидов тигра?",OccupationEnum.housewife,
             "омский", "енисейский", "ангарский", "амурский", .level1, .level4),
    
    Question("Что хором кричат дети на новогоднем празднике?",OccupationEnum.housewife,
             "Помогите!", "'Спартак' - чемпион!", "Жириновский!", "Снегурочка!", .level1, .level4),
    
    Question("У какой птицы спрашивают, сколько лет осталось прожить?",OccupationEnum.housewife,
             "у вороны", "у совы", "у дятла", "у кукушки", .level1, .level4),
    
    Question("то нередко просят соблюдать, приглашая на светский раут?",OccupationEnum.housewife,
             "диету", "клятву", "шаббат", "дресс-код", .level1, .level4),
    
    Question("Какую страну не относят к Скандинавии?",OccupationEnum.housewife,
             "Норвегию", "Швецию", "Данию", "Нидерланды", .level1, .level4),
    
    Question("Что в 90-е годы прошлого века было модно превращать в варёнку?",OccupationEnum.housewife,
             "грибы", "макулатуру", "серебро", "ткань", .level1, .level4),
    
    Question("Какой из этих актеров не играл в кино Джеймса Бонда?",OccupationEnum.housewife,
             "Шон Коннери", "Тимоти Далтон", "Дэниел Крейг", "Сильвестр Сталлоне", .level1, .level4),
    
    Question("Какая рыба существует на самом деле?",OccupationEnum.housewife,
             "рыба-эквилибрист", "рыба-фокусник", "рыба-гимнаст", "рыба-клоун", .level1, .level4),
    
    Question("Что, как говорят, делают с новым садом или сквером?",OccupationEnum.housewife,
             "набивают", "отбивают", "прибивают", "разбивают", .level1, .level4),
    
    Question("Что бывает транспортным?",OccupationEnum.housewife,
             "завязка", "обвязка", "подвязка", "развязка", .level1, .level4),
    
    Question("Что, образно говоря, делает человек, устраивающий застолье?",OccupationEnum.housewife,
             "пашет поле", "косит лужайку", "сащает рощу", "накрывает поляну", .level1, .level4),
    
    Question("Как в СССР назывался приз футбольной команде, отнявшей больше других очков у призеров чемпионата?",OccupationEnum.housewife,
             "Тайфун директоров", "Смерч начальников", "Ураган боссов", "Гроза авторитетов", .level1, .level4),
    
    Question("Кого суеверные люди боятся встретить на улице?",OccupationEnum.housewife,
             "белую собаку", "розовую свинку", "зеленого крокодила", "черную кошку", .level1, .level4),
    
    Question("Как закончит принцип морального кодекса строителя коммунизма: 'Человек человеку друг, товарищ и...'?",OccupationEnum.housewife,
             "и коллега", "и соратник", "и собутыльник", "и брат", .level1, .level4),
    
    Question("Во что в прошлом веке играло довольно много людей?",OccupationEnum.housewife,
             "в шашки по телеграфу", "в футбол по телефону", "в керлинг по СМС", "в шахматы по переписке", .level1, .level4),
    
    Question("Что имеют ввиду, когда говорят: 'Седьмая вода на киселе'?",OccupationEnum.housewife,
             "разбавленную сметану", "жидкий кисель", "дождливую погоду", "дальнее родство", .level1, .level4),
    
    Question("Что делали герои сказки Джанни Родари, схватив за волосы мальчика Чиполлино?",OccupationEnum.housewife,
             "смеялись", "замирали", "читали стихи", "плакали", .level1, .level4),
    
    Question("Как часто называют коварного лицемера, притворившегося добродушным человеком?",OccupationEnum.housewife,
             "воробей в павлиньих перьях", "заяц в медвежьей шерсти", "карась с акульей пастью", "волк в овечьей шкуре", .level1, .level4),
    
    Question("Какие игрушки упомянуты в колыбельной в заставке 'Спокойной ночи, малыши!'?",OccupationEnum.housewife,
             "мягкие", "развивающие", "фальшивые елочные", "усталые", .level1, .level4),
    
    Question("Как называется метод лечения, который пришел к нам с Востока?",OccupationEnum.housewife,
             "булавковтыкание", "пикопродырявливание", "шилоизвлечение", "иглоукалывание", .level1, .level4),
    
    Question("Что механики не относят к подъемным механизмам?",OccupationEnum.housewife,
             "домкрат", "лифт", "полиспаст", "будильник", .level1, .level4),
    
    Question("Что часто упоминают, говоря об изоляции государства?",OccupationEnum.housewife,
             "стальные шторы", "чугунные гардины", "медные портьеры", "железный занавес", .level1, .level4),
    
    Question("Как часто называют легкомысленную девушку?",OccupationEnum.housewife,
             "снежная", "дождливая", "облачная", "ветреная", .level1, .level4),
    
    Question("С чем имеет дело на работе крупье?",OccupationEnum.housewife,
             "с крупами и специями", "с крупповской сталью", "с крупным рогатым скотом", "с картами и фишками", .level1, .level4),
    
    Question("На что оставляет деньги предусмотрительный человек?",OccupationEnum.housewife,
             "на белые ночи", "на серое утро", "на сиреневый вечер", "на черный день", .level1, .level4),
    
    Question("Какого выражения не существует?",OccupationEnum.housewife,
             "шахматная партия", "выгодная партия", "политическая партия", "сталактитовая партия", .level1, .level4),
    
    Question("Что отмечали в гостях у Мухи-цокотухи тараканы, букашки, блошки и бабушка-пчела?",OccupationEnum.housewife,
             "Новый год", "8 марта", "День энтомолога", "именины", .level1, .level4),
    
    Question("Как порой называют навязчивую идею?",OccupationEnum.housewife,
             "идея икс", "идея микс", "идея БРИКС", "идея фикс", .level1, .level4),
    
    Question("Какой аттестат получает выпускник школы?",OccupationEnum.housewife,
             "свежести", "прелости", "скороспелости", "зрелости", .level1, .level4),
    
    Question("Какими метрами измеряют линолеум и ковролин?",OccupationEnum.housewife,
             "прогонными", "подгонными", "загонными", "погонными", .level1, .level4),
    
    Question("Грань какого цвета отсутствует в традиционной раскраске кубика Рубика?",OccupationEnum.housewife,
             "зеленый", "синий", "белый", "черный", .level1, .level4),
    
    Question("Как называется популярная игра на бумаге?",OccupationEnum.housewife,
             "Озерная стычка", "Речная драчка", "Океанское побоище", "Морской бой", .level1, .level4),
    
    Question("Что, как говорят, делают с интересными книгами?",OccupationEnum.housewife,
             "вылизывают", "прожевывают", "выпивают", "проглатывают", .level1, .level4),
    
    Question("Где не был Незнайка в произведениях Николая Носова?",OccupationEnum.housewife,
             "в Солнечном городе", "в Цветочном городе", "на Луне", "в Горгороде", .level1, .level4),
    
    Question("Как называют шустрого невысокого подростка?",OccupationEnum.housewife,
             "крючок", "засов", "задвижка", "шпингалет", .level1, .level4),
    
    Question("Какой тертый сыр чаще всего подают к спагетти?",OccupationEnum.housewife,
             "камамбер", "костромской", "моцареллу", "пармезан", .level1, .level4),
    
    Question("Как, согласно народной примете, всегда падает бутерброд?",OccupationEnum.housewife,
             "рыбой вверх", "колбасой в сторону", "икрой в никуда", "маслом вниз", .level1, .level4),
    
    Question("Как называют инициатора преступления?",OccupationEnum.housewife,
             "отстрельщик", "застрельщик", "стрелок", "подстрекатель", .level1, .level4),
    
    Question("Чего, как говорят, не стоит что-либо, не представляющее никакой ценности?",OccupationEnum.housewife,
             "дырявого пенни", "гнутой копейки", "потертого тугрика", "ломаного гроша", .level1, .level4),
    
    Question("Что часто говорят о человеке, оказавшемся не у дел?",OccupationEnum.housewife,
             "ест борщевик", "пьет березовый сок", "косит чертополох", "курит бамбук", .level1, .level4),
    
    Question("Как называют электрическую лампочку с металлической спиралью?",OccupationEnum.housewife,
             "прокаливания", "закаливания", "белого каления", "накаливания", .level1, .level4),
    
    Question("Куда обещали увезти героиню песни группы 'Блестящие'?",OccupationEnum.housewife,
             "за две звезды", "за три леса", "за семь холмов", "за четыре моря", .level1, .level4),
    
    Question("Кто бывает зеркальным?",OccupationEnum.housewife,
             "бегемот", "дятел", "таракан", "карп", .level1, .level4),
    
    Question("Что есть в горле человека?",OccupationEnum.housewife,
             "фундучины", "кокосины", "орешины", "миндалины", .level1, .level4),
    
    Question("Что обычно делают в коворкинге?",OccupationEnum.housewife,
             "доят коров", "сеют картошку", "коверкают слова", "работают", .level1, .level4),
    
    Question("С кем в сказке Перро встретился Мальчик-с-пальчик?",OccupationEnum.housewife,
             "с медведем", "с султаном", "с звездочетом", "с людоедом", .level1, .level4),
    
    Question("От названия какого дерева произошло слово 'шатен'?",OccupationEnum.housewife,
             "липа", "сосна", "баобаб", "каштан", .level1, .level4),
    
    Question("Как называлась регулярная пехота Османской империи?",OccupationEnum.housewife,
             "берсеркеры", "мамлюки", "центурионы", "янычары", .level1, .level4),
    
    Question("Кто вырастает из головастика?",OccupationEnum.housewife,
             "рыба", "ящерица", "крокодил", "лягушка", .level1, .level4),
    
    Question("Как заканчивается пословица: 'Рука руку...'?",OccupationEnum.housewife,
             "жмет", "бьет", "чешет", "моет", .level1, .level4),
    
    Question("Какая участь постигла теремок в одноимённой сказке?",OccupationEnum.housewife,
             "сгорел", "утонул", "подвергся рейдерскому захвату", "развалился", .level1, .level4),
    
    Question("К чему призывает гардемаринов припев песни в фильме Светланы Дружининой?",OccupationEnum.housewife,
             "не задирать нос", "не клевать носом", "не водить за нос", "не вешать нос", .level1, .level4),
    
    Question("Какой кнопки не найти на пульте кабины современного лифта?",OccupationEnum.housewife,
             "Стоп", "Вызов диспетчера", "13", "Поехали!", .level1, .level4),
    
    Question("Какое выражение означает то же, что 'идти пешком'?",OccupationEnum.housewife,
             "выйти в люди", "пойти по миру", "на все четыре стороны", "на своих двоих", .level1, .level4),
    
    Question("Из чего делают строганину?",OccupationEnum.housewife,
             "из сосны", "из мрамора", "из капусты", "из лосося", .level1, .level4),
    
    Question("При каком режиме работы стиральной машины особенно важна центробежная сила?",OccupationEnum.housewife,
             "стирка", "полоскание", "замачивание", "отжим", .level1, .level4),
    
    Question("Какие маленькие птицы танцуют в балете Чайковского?",OccupationEnum.housewife,
             "голуби", "павлины", "утята", "лебеди", .level1, .level4),
    
    Question("Где занимают места матросы парусника по команде 'Свистать всех наверх!'?",OccupationEnum.housewife,
             "на реях мачт", "на капитанском мостике", "на верхних койках", "на верхней палубе", .level1, .level4),
    
    Question("Как называется модель человеческого тела - наглядное пособие для будущих врачей?",OccupationEnum.housewife,
             "призрак", "дух", "зомби", "фантом", .level1, .level4),
    
    Question("Кем была Василиса Премудрая, когда поймала стрелу Ивана-царевича?",OccupationEnum.housewife,
             "Рыбкой", "Птичкой", "Букашкой", "Лягушкой", .level1, .level4),
    
    Question("Что просят сделать человека, чтобы он не подвёл в каком-то деле?",OccupationEnum.housewife,
             "Не укачать", "Не накачать", "Не откачать", "Не подкачать", .level1, .level4),
    
    Question("Какой слог есть в каждом слове?",OccupationEnum.housewife,
             "Клавишный", "Струнный", "Духовой", "Ударный", .level1, .level4),
    
    Question("Что время от времени предлагал окружающим Остап Бендер?",OccupationEnum.housewife,
             "От трусов штанины", "От митенок пальцы", "От кроссовок голенища", "От жилетки рукава", .level1, .level4),
    
    Question("Зачем дятел стучит по дереву?",OccupationEnum.housewife,
             "Привлекает самку", "Строит гнездо", "Греется", "Ищет еду", .level1, .level4),
    
    Question("На каком матрасе рекомендуют спать врачи?",OccupationEnum.housewife,
             "на хирургическом", "на логопедическом", "на стоматологическом", "на ортопедическом", .level1, .level4),
    
    Question("Как называется гриб?",OccupationEnum.housewife,
             "плащ", "макинтош", "тренч", "дождевик", .level1, .level4),
    
    Question("Чего не стоит, как говорят, незначительная проблема?",OccupationEnum.housewife,
             "колбасных обрезков", "шоколадной обертки", "банановой шкурки", "выеденного яйца", .level1, .level4),
    
    Question("Какой микроорганизм называется 'туфелька'?",OccupationEnum.housewife,
             "бактерия", "вирус", "гриб", "инфузория", .level1, .level4),
    
    Question("Какая фраза означает полное равнодушие и безразличие к последствиям?",OccupationEnum.housewife,
             "Хоть волком вой", "Хоть шаром покати", "Хоть пруд пруди", "Хоть трава не расти", .level1, .level4),
    
    Question("Что обычно заложено у простуженного человека?",OccupationEnum.housewife,
             "квартира", "Хдача", "автомобиль", "нос", .level1, .level4),
    
    Question("Какой из фильмов не мультипликационный?",OccupationEnum.housewife,
             "Каникулы Бонифация", "Каникулы в Простоквашино", "Монстры на каникулах", "Римские каникулы", .level1, .level4),
    
    Question("Какую группу называют 'Ливерпульской четверкой'?",OccupationEnum.housewife,
             "Дип перпл", "Скорпионз", "группу крови", "Битлз", .level1, .level4),
    
    Question("Как называют водителя, совершающего поездки на большие расстояния?",OccupationEnum.housewife,
             "стрелок", "бомбардир", "снайпер", "дальнобойщик", .level1, .level4),
    
    Question("Как зовут поросёнка, героя популярного мультфильма?",OccupationEnum.housewife,
             "Франтик", "Финтик", "Фантик", "Фунтик", .level1, .level4),
    
    Question("Как называется популярное блюдо венской кухни?",OccupationEnum.housewife,
             "цоколь", "циркуль", "вензель", "шницель", .level1, .level4),
    
    Question("Какого хоккея не существует?",OccupationEnum.housewife,
             "подводного", "подледного", "вертикального", "болотного", .level1, .level4),
    
    Question("Как называется охраняемая природная территория?",OccupationEnum.housewife,
             "лабазник", "отказник", "проказник", "заказник", .level1, .level4),
    
    Question("Как заканчивается строчка Агнии Барто: 'Весна, весна на улице, весенние деньки! Как птицы, заливаются...'?",OccupationEnum.housewife,
             "пожарные гудки", "веселые щенки", "печатные станки", "трамвайные звонки", .level1, .level4),
    
    Question("Что требуется для игры в классики?",OccupationEnum.housewife,
             "парта и доска", "томик Пушкина", "дирижерская палочка", "мел и битка", .level1, .level4),
    
    Question("Памятник кому в Санкт-Петербурге закладывал Арчил Гомиашвили?",OccupationEnum.housewife,
             "Чижику-Пыжику", "котёнку Фунтику", "фотографу на Малой Садовой", "Остапу Бендеру", .level1, .level4),
    
    Question("Какая техническая новинка в 1975 году стоила 20 тысяч долларов?",OccupationEnum.mathematician,
    "мобильный телефон", "CD- плеер", "видеомагнитофон", "персональный компьютер", .level1, .level4),
    
    Question("чем связано возникновение выражения «пуститься во все тяжкие»?",OccupationEnum.litterateur,
             "с пушками", "с бочками", "с каретами", "с колоколами", .level1, .level4),
    
    Question("Как держит хвост довольная кошка?",OccupationEnum.housewife,
             "тромбоном", "саксофоном", "геликоном", "трубой", .level1, .level4),
    
    Question("Как называется информационная программа Первого канала?",OccupationEnum.housewife,
             "Бремя", "Стремя", "Пламя", "Время", .level1, .level4),
    

    Question("Чем врачи корректируют зрение?",OccupationEnum.housewife,
             "подзатыльником", "световым мечом", "уговорами", "лазером", .level1, .level4),


    Question("Кого часто вспоминают, говоря о спиртных напитках?",OccupationEnum.housewife,
             "черного ворона", "белую акулу", "розового фламинго", "зеленого змия", .level1, .level4),

    
    Question("Какому прибору дал название теплый и сухой ветер, дующий с гор в долины?",OccupationEnum.housewife,
             "утюгу", "миксеру", "тостеру", "фену", .level1, .level4),

    
    Question("Какая повесть Аркадия Гайдара дала имя торту на основе безе?",OccupationEnum.housewife,
             "Лесные братья", "Военная тайна", "Судьба барабанщика", "На графских развалинах", .level1, .level4),
    
    Question("Сколько щенков-далматинцев стали героями книги, мультфильма и сериала?",OccupationEnum.housewife,
             "1984", "7", "9 с половиной", "101", .level1, .level4),
    
    
    Question("Чем, как говорят, намазано очень привлекательное место?",OccupationEnum.housewife,
             "джемом", "йодом", "кетчупом", "медом", .level1, .level4),

    Question("Чем пользуется каждый электросварщик на стройке?",OccupationEnum.housewife,
             "эликсиром", "электроном", "элеватором", "электродом", .level1, .level4),
    
    Question("Куда должны повернуть голову по команде: 'Равняйсь' стоящие в строю российские военнослужащие?",OccupationEnum.housewife,
             "налево", "прямо", "в любую сторону", "направо", .level1, .level4),
    
    
    Question("У каких животных шерсть растет в необычном направлении - от брюха к спине?",OccupationEnum.housewife,
             "у панд", "у коал", "у кенгуру", "у ленивцев", .level1, .level4),
    
    

    //45
    
    Question("Как называется соревнование разных по классу участников с предоставлением форы слабейшим?",OccupationEnum.sportReviewer,
             "Пелетон", "Форманта", "Ганглиоз", "Гандикап", .level5, .level7),
    
    Question("Что можно назвать орудием труда стрингера?",OccupationEnum.housewife,
             "миномет и гранатомет", "ножницы и клей", "стринги и колготки", "фотоаппарат и камеру", .level5, .level7),
    
    Question("Какие существа, по легенде, часто носят с собой мешочки с золотом?",OccupationEnum.housewife,
             "кицунэ", "тролли", "гоблины", "лепреконы", .level5, .level7),
    
    Question("Как называется специальная одежда военнослужащих?",OccupationEnum.housewife,
             "плащ-палатка", "плащ-казарма", "плащ-Дворец съездов", "плащ-кибитка", .level5, .level7),
    
    Question("Что умел делать плащ доктора Стрэнджа - героя кино и комиксов?",OccupationEnum.housewife,
             "делать хозяина невидимым", "разговаривать", "стрелять", "летать", .level5, .level7),
    
    Question("Какой город реально существует?",OccupationEnum.housewife,
             "Зурбаган", "Глупов", "Арканар", "Урюпинск", .level5, .level7),
    
    Question("Какой из этих женских музыкальных коллективов справедливо назвать трио?",OccupationEnum.housewife,
             "Спайс герлз", "Тату", "Комбинация", "Арабески", .level5, .level7),
    
    Question("В какой из игр ни один из судей не сидит на вышке?",OccupationEnum.housewife,
             "теннис", "бадминтон", "волейбол", "настольный теннис", .level5, .level7),
    
    Question("Кто выполняет асаны?",OccupationEnum.housewife,
             "маги", "йокодзуны", "бонзы", "йоги", .level5, .level7),
    
    Question("Какой танец дал название улице для карнавалов в Рио-де-Жанейро?",OccupationEnum.housewife,
             "румба", "танго", "пасодобль", "самба", .level5, .level7),
    
    Question("Какой фильм снял не Никита Михалков?",OccupationEnum.housewife,
             "Пять вечеров", "Раба любви", "Родня",  "Статский советник", .level5, .level7),
    
    Question("Кто был первый президентом Соединённых Штатов Америки?",OccupationEnum.housewife,
             "Томас Джефферсон", "Авраам Линкольн", "Бенджамин Франклин", "Джордж Вашингтон", .level5, .level7),
    
    Question("Какая из этих кислот является витамином?",OccupationEnum.biologist,
             "Молочная", "Яблочная", "Янтарная", "Никотиновая", .level5, .level7),
    
    Question("Одним из направлений какой религиозной философии является учение дзен?",OccupationEnum.litterateur,
             "Иудаизм", "Индуизм", "Даосизм", "Буддизм", .level5, .level7),
    
    Question("Сколько лет рыбачил старик из сказки А.С.Пушкина 'Сказка о рыбаке и рыбке'?",OccupationEnum.litterateur,
             "43", "23", "53", "33", .level5, .level7),
    
    Question("Облик какой женщины дошёл до наших дней благодаря скульптору Тутмесу?",OccupationEnum.historian,
             "Клеопатры", "Далилы", "Семирамды", "Нефертити", .level5, .level7),
    
    Question("Как назывался первый атомный ледокол СССР?",OccupationEnum.historian,
             "Сталин", "Свердлов", "Киров", "Ленин", .level5, .level7),
    
    Question("Что означает количество пятнышек у божьей коровки?",OccupationEnum.biologist,
             "Возраст", "Пол", "Дату рождения", "Вид", .level5, .level7),
    
    Question("Кто изображен на правом плече Марадоны?",OccupationEnum.sportReviewer,
             "Фидель Кастро", "Ким Чен Ир", "Пеле", "Че Гевара", .level5, .level7),
    
    Question("Цветы какого из этих растений не голубого цвета?",OccupationEnum.biologist,
             "Василек", "Колокольчик", "Незабудка", "Лютик", .level5, .level7),
    
    Question("В какие годы строился Колизей?",OccupationEnum.historian,
             "260-300", "580-605", "1085-1124","72-80", .level5, .level7),
    
    Question("Какое кондитерское изделие традиционно делают в Европе к Рождеству?",OccupationEnum.housewife,
             "тульский пряник", "ромовую бабу", "марципановую свинку", "пряничный домик", .level5, .level7),
    
    Question("Какое украшение в виде змейки стало уликой в фильме 'Место встречи изменить нельзя'?",OccupationEnum.housewife,
             "брошь", "кольцо", "кулон", "браслет", .level5, .level7),
    
    Question("Каким цветом обозначена Кольцевая линия на карте московского метро?",OccupationEnum.housewife,
             "синим", "красным", "зеленым", "коричневым", .level5, .level7),
    
    Question("Какой снаряд в спортивной гимнастике есть и у женщин, и у мужчин?",OccupationEnum.housewife,
             "бревно", "кольца", "конь", "брусья", .level5, .level7),
    
    Question("В какое море впадает Жёлтая река?",OccupationEnum.geographer,
             "Ионическое море", "Чёрное море", "Каспийское море", "Жёлтое море", .level5, .level7),
    
    Question("Какую из этих опер написал Моцарт?",OccupationEnum.litterateur,
             "Сицилийская вечерня", "Сельская честь", "Севильский цирюльник", "Свадьба Фигаро", .level5, .level7),
    
    Question("О чем русская загадка: 'На тычинке городок, в нем семьсот воевод'?",OccupationEnum.housewife,
             "колос", "улей", "метла", "мак", .level5, .level7),
    
    Question("Что послужило причиной утери кончиков пальцев правой руки статуи Христа Спасителя в Рио-де-Жанейро?",OccupationEnum.housewife,
             "трос скалолазов", "квадрокоптер", "брак при возведении", "удары молний", .level5, .level7),
    
    Question("Флаг какой страны нельзя назвать триколором?",OccupationEnum.housewife,
             "России", "Франции", "Нидерландов", "Польши", .level5, .level7),
    
    Question("Что держит в руках кинемотографический 'Оскар'?",OccupationEnum.housewife,
             "рулон кинопленки", "трость", "кинохлопушку", "меч", .level5, .level7),
    
    Question("Что собирался 'волком выгрызть' Маяковский в 'Стихах о советском паспорте'?",OccupationEnum.housewife,
             "постмодернизм", "волюнтаризм", "феминизм", "бюрократизм", .level5, .level7),
    
    Question("Где построили суперлайнер 'Титаник'?",OccupationEnum.housewife,
             "в Германии", "в США", "в Японии", "в Англии", .level5, .level7),
    
    Question("Именем какого древнего грека часто называют наставника молодежи?",OccupationEnum.housewife,
             "Одиссей", "Ахилл", "Гектор", "Ментор", .level5, .level7),
    
    Question("В какой коктейль традиционно добавляют листья мяты?",OccupationEnum.housewife,
             "Дайкири", "Маргарита", "Космополитен", "Мохито", .level5, .level7),
    
    Question("Кого пасла 'красавица одна' в песне 'Все могут короли' в исполнении Аллы Пугачевой?",OccupationEnum.housewife,
             "коз", "свиней", "коров", "гусей", .level5, .level7),
    
    Question("Из какого злака получают манную крупу?",OccupationEnum.biologist,
             "рожь", "ячмень", "просо", "пшеница", .level5, .level7),
    
    Question("Главный герой какого романа Ф.М. Достоевского мечтал стать Ротшильдом?",OccupationEnum.litterateur,
             "Идиот", "Бесы", "Братья Карамазовы", "Подросток", .level5, .level7),
    
    Question("Молоко какого животного легко усваивается даже людьми с непереносимостью лактозы?",OccupationEnum.housewife,
             "Козье", "Ослиное", "Коровье", "Верблюжье", .level5, .level7),
    
    Question("Где покоится прах американского астронома Юджина Шумейкера?",OccupationEnum.housewife,
             "на Марсе", "на Юпитере", "на Земле", "на Луне", .level5, .level7),
    
    Question("Что стало жилищем героев известной песни 'Битлз'?",OccupationEnum.housewife,
             "синий троллейбус", "зелёный поезд", "последняя электричка", "жёлтая подводная лодка", .level5, .level7),
    
    Question("Из чего готовится французский деликатес, благодаря которому французы получили одно из своих прозвищ?",OccupationEnum.housewife,
             "Пауки", "Кузнечики", "Тараканы", "Лягушки", .level5, .level7),
    
    Question("К какой кухне принадлежит кофейный напиток Капучино?",OccupationEnum.housewife,
             "Французской", "Румынской", "Испанской", "Итальянской", .level5, .level7),
    
    Question("К какому жанру относится фильм «Кин-дза-дза!»?",OccupationEnum.housewife,
             "Комедия положений", "Фарс", "Пародия", "Антиутопия", .level5, .level7),
    
    Question("Где два Стивена, Джобс и Возняк, собрали свой первый полноценный персональный компьютер?",OccupationEnum.historian,
             "на чердаке", "на кухне", "в сауне", "в гараже", .level5, .level7),
    
    Question("Как называется пьеса Александра Островского?",OccupationEnum.housewife,
              "Торнадо", "Ураган", "Тайфун", "Гроза", .level5, .level7),
    
    Question("В каком отделе позвоночника человека позвонки являются неподвижными?",OccupationEnum.biologist,
    "В шейном", "В грудном", "В поясничном", "В крестцовом", .level5, .level7),
    
    Question("Куда посылал публику Самуэль Харрис из фильма 'Трое в лодке, не считая собаки'?",OccupationEnum.housewife,
             "На улицу", "Домой", "Вон", "В сад", .level5, .level7),
    
    Question("Когда происходит действие фильма 'Место встречи изменить нельзя'?",OccupationEnum.housewife,
             "В 1924 году", "В 1945 году", "В 1899 году", "В 1969 году", .level5, .level7),
    
    Question("Что просит привезти Василия младшая дочь в качестве сувенира в фильме «Любовь и Голуби»?",OccupationEnum.housewife,
             "Ракушек и медуз", "Морской песок и кокос", "Черепаху", "Ракушек и пальму", .level5, .level7),
    
    Question("На каком курорте происходит действие фильма, а именно знакомство Василия и Раисы Захаровны в фильме «Любовь и Голуби»?",OccupationEnum.housewife,
             "В Крыму", "В Сочи", "В Анапе", "В Батуми", .level5, .level7),
    
    Question("Руководителем какого класса стал Нестор Петрович в фильме «Большая перемена»?",OccupationEnum.housewife,
             "10А", "11А", "9Б", "9А", .level5, .level7),
    
    Question("Кто из героев хотел сделать из Ляпишева не просто человека, а совершенного человека в фильме «Большая перемена»?",OccupationEnum.housewife,
             "Светлана Афанасьевна", "Ваня Федоскин", "Нелли Леднёва", "Александр Трофимович", .level5, .level7),
    
    Question("Кто из героев стал добровольным помощником Нестора Петровича в фильме «Большая перемена»?",OccupationEnum.housewife,
             "Александр Трофимович Петрыкин", "Ваня Федоскин", "Серафима Павловна", "Степан Семёнович Леднёв", .level5, .level7),
    
    Question("Кто из героинь фильма, посещавших вечернюю школу, нигде не работал в фильме «Большая перемена»?",OccupationEnum.housewife,
             "Люся", "Чувичкина", "Валя", "Виктория Коровянская", .level5, .level7),
    
    Question("Кто был режиссером фильма «Кин-дза-дза!»?",OccupationEnum.housewife,
             "Марк Захаров", "Дато Дженлидзе", "Григорий Ломидзе", "Георгий Данелия", .level5, .level7),
    
    Question("Что в прошлом не использовалось для письма?",OccupationEnum.housewife,
             "папирус", "пергамент", "глиняные таблички", "бумазея", .level5, .level7),
    
    Question("Чем паук-серебрянка наполняет своё подводное гнездо?",OccupationEnum.housewife,
             "крыльями мух", "водорослями", "жемчужинками", "пузырьками воздуха", .level5, .level7),
    
    Question("Что традиционно является основным десертом в Французской кухне?",OccupationEnum.housewife,
                 "Крем", "Фрукты", "Утрицы", "Сыр", .level5, .level7),
    
    Question("Что должно быть в настоящем бутерброде, если судить по происхождению слова?",OccupationEnum.housewife,
             "колбаса", "сыр", "варенье", "масло", .level5, .level7),
    
    Question("Как называется третья нота в гамме в соль мажор?",OccupationEnum.litterateur,
             "Фа", "Ре", "Ля", "Си", .level5, .level7),
    
    Question("Как звали гениального австриского композитора, который начал сочинять музыку в 7 лет?",OccupationEnum.litterateur,
             "Бетховен", "Шопен", "Бах", "Моцарт", .level5, .level7),
    
    Question("В Китае невесты надевают платья…",OccupationEnum.erudite,
             "Черного цвета", "Белого цвета", "Оранжевого цвета", "Красного цвета", .level5, .level7),
    
    Question("Кто в фильме Владимира Меньшова произносит фразу «Москва слезам не верит»?",OccupationEnum.housewife,
             "Катерина", "Коля", "Гоша", "Людмила", .level5, .level7),
    
    

    //46
    
    Question("В какой пустыне проводились съемки сцен фильма «Кин-дза-дза!»?",OccupationEnum.housewife,
             "В пустыне Гоби", "В пустыне Сахара", "На побережье Финского залива", "В пустыне Каракумы", .level8, .level10),
    
    Question("Что такое ферменты, биологические катализаторы?",OccupationEnum.biologist,
             "Кислоты", "Жиры", "Паразиты", "Белки", .level8, .level10),
    
    Question("Что жарят и продают на улицах Парижа?",OccupationEnum.housewife,
             "Грецкие орехи", "Жёлуди", "Шишки", "Каштаны", .level8, .level10),
    
    Question("Кто является чемпионом гонок 'Формулы-1' 1998-99 г.г.?",OccupationEnum.sportReviewer,
             "М. Шумахер","Барикелло", "Кулхард", "Хаккинен", .level8, .level10),
    
    Question("Какой из этих городов - родина Казановы?",OccupationEnum.geographer,
             "Неаполь", "Милан", "Флоренция", "Венеция", .level8, .level10),
    
    Question("Кто считается основоположником кубизма?",OccupationEnum.historian,
             "В. Кандинский", "Ф. Леже", "К. Малевич", "П. Пикассо", .level8, .level10),
    
    Question("Какую икру больше всего любил Джеймс Бонд?",OccupationEnum.housewife,
             "Осетровую", "Севрюжью", "Стерляжью","Белужью", .level8, .level10),
    
    Question("В каком городе в 1932 году был проведён первый международный кинофестиваль?",OccupationEnum.historian,
             "Канн", "Париж", "Берлин", "Венеция", .level8, .level10),
    
    Question("Сколько раз в сутки подзаводят часы на Спасской башне московского Кремля?",OccupationEnum.historian,
             "Один", "Три", "Четыре","Два", .level8, .level10),
    
    Question("К какому семейству рыб принадлежит пескарь?",OccupationEnum.biologist,
             "Щуковые", "Бычковые", "Колюшковые ", "Карповые", .level8, .level10),
    
    Question("Кем по образованию был Антон Павлович Чехов?",OccupationEnum.litterateur,
             "Юрист", "Учитель", "Дипломат", "Врач", .level8, .level10),
    
    Question("Флаг какого государства не трёхцветный?",OccupationEnum.housewife,
             "Бельгии", "Ирландии", "Румынии", "Албании", .level8, .level10),
    
    Question("Из какого меxа сделаны шапки королевскиx гвардейцев Великобритании?",OccupationEnum.biologist,
             "Волчий", "Овечий", "Соболиный", "Медвежий", .level8, .level10),
    
    Question("Кто из великих художников Возрождения расписывал Сикстинскую капеллу Ватикана?",OccupationEnum.historian,
             "Леонардо", "Рафаэль", "Тициан", "Микеланджело", .level8, .level10),
    
    Question("Кто сыграл Мальволио в фильме 'Двенадцатая ночь'?",OccupationEnum.housewife,
             "Ильинский", "Филиппов", "Яншин",  "Меркурьев", .level8, .level10),
    
    Question("Какое вино необходимо для приготовления классического крюшона?",OccupationEnum.biologist,
             "Мадера", "Портвейн", "Красное столовое", "Белое столовое", .level8, .level10),
    
    Question("Как по-другому называют койота?",OccupationEnum.biologist,
             "Пустынный волк", "Тропический волк", "Лесной волк", "Луговой волк", .level8, .level10),
    
    Question("Какой математический символ ввёл в математику Лейбниц?",OccupationEnum.mathematician,
             "логарифм", "модуль", "квадратный корень", "интеграл", .level8, .level10),
    
    Question("Кто такой речной сверчок?",OccupationEnum.biologist,
             "рыба", "насекомое", "рептилия", "птица", .level8, .level10),
    
    Question("В какиx войскаx служил Лев Толстой?",OccupationEnum.litterateur,
             "Флот", "Пеxота", "Кавалерия", "Артиллерия", .level8, .level10),
    
    Question("Кто оставил в дневнике запись: 'С благословения Маршака пишу на ту же тему по-своему'?",OccupationEnum.housewife,
             "Константин Паустовский", "Владимир Высоцкий", "Аркадий Гайдар", "Алексей Толстой", .level8, .level10),
    
    Question("Что, по словам подпоручика Семена из 'Белого солнца пустыни', у Верещагина оказалось не той системы?",OccupationEnum.housewife,
             "динамит", "патроны", "пулемет", "гранаты", .level8, .level10),
    
    Question("Какое мифологическое чудовище часто изображали с хохолком, похожим на корону?",OccupationEnum.housewife,
             "мантикора", "грифон", "дракон", "василиск", .level8, .level10),
    
    Question("Что отличает плиссированную юбку?",OccupationEnum.housewife,
             "число пуговиц", "число бретелек", "число карманов", "число складок", .level8, .level10),
    
    Question("Какого ореха не существует?",OccupationEnum.housewife,
             "грецкого", "бразильского", "маньчжурского", "эфиопского", .level8, .level10),
    
    Question("Какое дерево французы прозвали 'хлебным'?",OccupationEnum.housewife,
             "дуб", "яблоню", "сосну", "каштан", .level8, .level10),
    
    Question("Кто из футболистов не Давид?",OccupationEnum.housewife,
             "грузин Кипиани", "испанец де Хеа", "бразилец Луис", "француз Жиру", .level8, .level10),
    
    Question("Как называли низкосортную, дешёвую колбасу?",OccupationEnum.biologist,
             "крокодиловы слёзы", "телячьи нежности", "лебединая песня", "собачья радость", .level8, .level10),
    
    Question("Как называется один из важнейших фондовых индексов в Японии?",OccupationEnum.erudite,
             "Yisei", "Nippon", "Nisei", "Nikkei", .level8, .level10),
    
    Question("Как назывался ящик, в который при царе Алексее Михайловиче складывали жалобы на дьяков и подьячих?",OccupationEnum.historian,
             "короткий", "чёрный", "ящик Пандоры", "долгий", .level8, .level10),
    
    Question("В какую страну вторглись советские войска 30 ноября 1939 года?",OccupationEnum.historian,
             "Польша", "Иран", "Румыния", "Финляндия", .level8, .level10),
    
    Question("Какое из этих австралийских животных не имеет сумки?",OccupationEnum.biologist,
             "Ехидна", "Коала", "Вомбат", "Утконос", .level8, .level10),
    
    Question("Где прожил последние годы до возвращения в США Эрнест Хемингуэй?",OccupationEnum.litterateur,
             "Испания", "Ямайка", "Гаити", "Куба", .level8, .level10),
    
    Question("Назовите старшую из великих княжон - дочерей Николая II",OccupationEnum.historian,
             "Анастасия", "Мария", "Татьяна", "Ольга", .level8, .level10),
    
    Question("Какое животное, почувствовав опасность, притворяется мертвым?",OccupationEnum.biologist,
             "Страус", "Кенгуру", "Утконос", "Опоссум", .level8, .level10),
    
    Question("Кто режиссёр фильма «Д’Артаньян и три мушкетёра»?",OccupationEnum.housewife,
             "Эльдар Рязанов", " Марк Захаров", "Юрий Кочаловский", "Георгий Юнгвальд-Хилькевич", .level8, .level10),
    
    Question("Кто сыграл роль Миледи в этом фильме «Д’Артаньян и три мушкетёра»?",OccupationEnum.housewife,
             "Ирина Алфёрова", "Алиса Фрейндлих", "Елена Цыплакова", "Маргарита Терехова", .level8, .level10),
    
    Question("Роль какого из трёх мушкетеров сыграл Вениамин Смехов?",OccupationEnum.housewife,
             "Атос", "Партос", "Д’Артаньян", "Арамис", .level8, .level10),
    
    Question("Как назывался первый советский фантастический фильм?",OccupationEnum.housewife,
             "Гости из будущего", "Приключения Электроника", "Москва-Кассиопея", "Аэлита", .level8, .level10),
    
    Question("Кто снял фильм «Иван Васильевич меняет профессию»?",OccupationEnum.housewife,
             "Тарковский", "Рязанов", "Михалков", "Гайдай", .level8, .level10),
    
    Question("Кто из советских актеров снимался в фильме «Гений»?",OccupationEnum.housewife,
             "Караченцов", "Янковский", "Боярский", "Абдулов", .level8, .level10),
    
    Question("Кто режиссёр фильма «Белое солнце пустыни»?",OccupationEnum.housewife,
             "Рязанов", "Дашкевич", "Михалков", "Мотыль", .level8, .level10),
    
    Question("В какой период происходит действие фильма «Белое солнце пустыни»?",OccupationEnum.housewife,
             "В 1890-е годы", "В 1970-е годы", "В 1940-е годы", "В 1920-е годы", .level8, .level10),
    
    Question("Какой из этих актеров сыграл роль дяди Мити в фильме «Любовь и Голуби»?",OccupationEnum.housewife,
             "Владимир Меньшов", "Игорь Лях", "Александр Михайлов", "Сергей Юрский", .level8, .level10),
    
    Question("Как называется комедия В. В. Маяковского?",OccupationEnum.litterateur,
             "Пена", "Жук", "Паук","Клоп", .level8, .level10),
    
    Question("У какого служащего российской армии на погоне не три звезды?",OccupationEnum.housewife,
             "старший лейтенант", "полковник", "старший прапорщик", "генерал армии", .level8, .level10),
    
    Question("Что такое рыдван?",OccupationEnum.housewife,
             "сундук", "сарай", "колокол", "карета"),
    
    Question("Чью волевую, мощную фигуру Микеланджело изваял для гробницы папы Юлия II?",OccupationEnum.housewife,
             "Иисуса Христа", "Иоанна Крестителя", "Адама", "Моисея"),
    
    Question("Какого стихотворения нет у Сергея Есенина?",OccupationEnum.housewife,
             "Письмо деду", "Письмо к сестре", "Письмо матери", "Письмо к брату", .level8, .level10),
    
    Question("Какая фамилия была у героини фильма 'Девушка без адреса'?",OccupationEnum.housewife,
             "Петрова", "Сидорова", "Кузнецова", "Иванова", .level8, .level10),
    
    Question("Где оставляли автографы знаменитости, приходившие в Большой драматический театр Ленинграда?",OccupationEnum.housewife,
              "на изнаночной стороне занавеса", "на столе Товстоногова", "на стене актерского буфета", "на потолке гримерки", .level8, .level10),
    
    Question("Какой город не расположен на пути из Москвы в Санкт-Петербург?",OccupationEnum.housewife,
             "Тверь", "Вышний Волочек", "Торжок", "Коломна", .level8, .level10),

    Question("Как называется официальная валюта Словении?",OccupationEnum.housewife,
             "куна", "динар", "крона", "евро", .level8, .level10),
    
    Question("Что в Москве, Уфе и Волгограде отмечено вмонтированной в брусчатку металлической плитой, а в Барнауле - каменной колонной?",OccupationEnum.housewife,
             "исторический центр города", "рубеж обороны", "место падения метеорита", "нулевой километр", .level8, .level10),
    
    Question("На какой реке стоит Тверь?",OccupationEnum.geographer,
               "Днепр", "Урал", "Тверь", "Волга", .level8, .level10),

    Question("Кто первым доказал периодичность появления комет?",OccupationEnum.historian,
             "Менделеев", "Коперник", "Кеплер", "Галлей", .level8, .level10),
    
    Question("С какой из этих стран Чехия не граничит?",OccupationEnum.geographer,
             "Германия", "Австрия", "Польша","Венгрия", .level8, .level10),
    
    Question("Какая из этих рек впадает в Азовское море?",OccupationEnum.geographer,
             "Днестр", "Южный Буг", "Днепр", "Дон", .level8, .level10),
    
    Question("Кто из этих великих футболистов прошлого был защитником?",OccupationEnum.sportReviewer,
             "Платини", "Гарринча", "Эйсебио", "Беккенбауэр", .level8, .level10),
    
    Question("Кто из этих российских императоров и императриц правил раньше остальных?",OccupationEnum.historian,
             "Елизавета Петровна", "Петр III", "Екатерина II", "Анна Иоановна", .level8, .level10),
    
    Question("Как называл народ медную монету в 3 копейки после 40 годов XIX века?",OccupationEnum.historian,
             "Гривенник", "Гривна", "Грош", "Гривенный", .level8, .level10),
    
    Question("Где Николай Чернышевский написал свой роман 'Что делать?'",OccupationEnum.litterateur,
             "Дома", "В ссылке", "На каторге", "В тюрме", .level8, .level10),
    
    Question("Сколько атомов кислорода содержится в молекуле озона?",OccupationEnum.biologist,
             "4", "2", "6", "3", .level8, .level10),
    
    Question("На какой реке стоит город Саратов?",OccupationEnum.geographer,
             "Кама", "Дон", "Обь", "Волга", .level8, .level10),
    
    Question("Какой из этих регионов - не на территории Италии?",OccupationEnum.geographer,
              "Тоскана", "Ломбардия", "Умбрия", "Савойя", .level8, .level10),
    
    
    
    
    
    Question("Что находилось в сердцевине волшебной палочки Гарри Поттера?",OccupationEnum.housewife,
             "волос единорога", "сердечная жила дракона", "цветок папоротника",  "перо феникса"),
    
    Question("'Живи так, будто умрешь завтра'. А что Махатма Ганди советовал делать так, будто проживешь вечность?",OccupationEnum.housewife,
             "молиться", "писать книги", "любить",  "учиться"),
    
    Question("Как переводится с древнегреческого имя Ирина?",OccupationEnum.housewife,
             "Свобода", "Счастье", "Греется", "Гнев"),
    
    Question("Как, в переводе на русский язык, звучало бы название фильма 'Мимино'?",OccupationEnum.housewife,
             "Медведь", "Гора", "Любовь", "Сокол"),
    
    Question("Территория какой из этих стран - наибольшая?",OccupationEnum.geographer,
             "Германия", "Италия", "Финляндия", "Япония"),
    
    Question("Какой химический элемент был назван в честь злого подземного гнома?",OccupationEnum.biologist,
             "Гафний", "Бериллий", "Теллур","Кобальт"),
    
    Question("Сестры с каким именем не было среди героинь чеховских «Трёх сестёр»?",OccupationEnum.litterateur,
             "Мария", "Ирина", "Ольга", "Анна"),
    
    Question("Какой европейский город раньше носил название Лютеция?",OccupationEnum.historian,
             "Тулуза", "Милан", "Лондон","Париж"),
    
    Question("Изобретатель тачки?",OccupationEnum.historian,
             "Пифагор", "Архимед", "Эдисон", "Паскаль"),
    
    Question("Что означает слово 'бедуин' на арбском языке?",OccupationEnum.litterateur,
             "Искатели воды", "Путешественники", "Корабли пустыни", "Обитатели пустыни"),
    
    Question("В какой из этих столиц союзных республик раньше всего появилось метро?",OccupationEnum.historian,
             "Ереван", "Баку", "Минск", "Тбилиси"),
    
    Question("В какой области науки проявились выдающиеся способности Софьи Ковалевской?",OccupationEnum.historian,
             "Химия", "Биология", "Философия", "Математика"),
    
    Question("Как иначе называют гевею?",OccupationEnum.biologist,
             "виниловое дерево", "нейлоновое дерево", "пластмассовое дерево", "резиновое дерево"),
    
    Question("Как называется группа из пяти фигурок - официальный талисман Олимпийских игр в Пекине?",OccupationEnum.sportReviewer,
             "Сыновья победы", "Братья фортуны", "Друзья спорта", "Дети удачи"),
    
    Question("Какой из этих химических элементов был открыт в России?",OccupationEnum.biologist,
             "Родий", "Тулий", "Самарий", "Рутений"),
    
    Question("Какое кодовое название было у первого термоядерного взрывного устройства?",OccupationEnum.mathematician,
             "Тринити","Малыш", "Толстяк", "Майк"),
    
    Question("Какой стране принадлежат Шантарские острова?",OccupationEnum.geographer,
             "Индонезия", "Филиппины", "Въетнам", "Россия"),
    
    Question("Какая олимпийская дистанция плавания самая длинная?",OccupationEnum.sportReviewer,
             "800 м", "2000 м", "1000 м", "1500 м"),
    
    Question("В какой стране зародилась игра кегли?",OccupationEnum.historian,
             "Голландия", "Швейцария", "Австрия", "Германия"),
    
    Question("С каким животным связана история основания города Ярославля?",OccupationEnum.historian,
             "Скунс", "Мышь", "Белка", "Медведь"),
    
    Question("Какие московские пруды одно время назывались Пионерскими?",OccupationEnum.historian,
             "Борисовкие", "Сарлетские", "Чистые", "Патриаршие"),
    
    Question("Каких мужчин боятся больные погонофобией?",OccupationEnum.biologist,
             "Лысых", "Рыжих", "Усатых", "Бородатых"),
    
    Question("Военно-политический союз России с какой страной стал предпосылкой образования Антанты?",OccupationEnum.historian,
             "Германия", "Англия", "Испания", "Франция"),
    
    Question("Какая сельскохозяйственная культура сама удобряет почву?",OccupationEnum.biologist,
             "Свекла", "Кукуруза", "Рожь", "Горох"),
    
    Question("Какой народ на Руси называли лопарями?",OccupationEnum.historian,
             "Карелов", "Ненцев", "Коми", "Саамов"),
    
    Question("Как называется ненависть, нетерпимость к кому-либо или чему-либо чужому, незнакомому, непривычному?",OccupationEnum.litterateur,
             "Иорофобия", "Клаустрофобия", "Агорафобия", "Ксенофобия"),

    Question("Какая религия запрещает изображение человека в натуральную величину?",OccupationEnum.litterateur,
             "Буддизм", "Иудаизм", "Христианство", "Ислам"),
    
    Question("Какого цвета ягоды ядовитого плюща?",OccupationEnum.biologist,
             "Синие", "Красные", "Черные", "Белые"),
    
    Question("Чем в Древней Греции руководил корифей?",OccupationEnum.historian,
             "школой", "посольством", "строительством", "хором"),
    
    Question("Слово кибернетика - производное от греческого слова, означающего:",OccupationEnum.historian,
             "Быстрый счет", "Божественное знание", "Направленное действие", "Искусство управления", .level8, .level11),
    
    Question("Кто убил Петра Столыпина?",OccupationEnum.historian,
             "Засулич", "Перовская", "Азеф", "Богров"),
    
    Question("С кого собирал налоги Земский приказ, созданный в 1564 году и просуществовавший до 1699 года?",OccupationEnum.historian,
             "с крестьян российских деревень", "с торговцев зерном", "с крупных землевладельцев", "с жителей Москвы"),
    
    Question("Какой нагревательный прибор не имеет фитиля?",OccupationEnum.historian,
             "керосинка", "керогаз", "спиртовка", "примус"),
    
    Question("Какое правило помогает определить направление магнитного поля электрического тока?",OccupationEnum.mathematician,
             "Правило винтика", "Правило шпунтика", "Правило шурупчика", "Правило буравчика"),
    
    Question("Административным центром каких островов является город Гонолулу?",OccupationEnum.geographer,
             "Панамских", "Канарских", "Вердинских", "Гавайских"),
    
    Question("Что изучает семиотика?",OccupationEnum.litterateur,
             "Человекообразных обезьян", "Происхождение слов", "Флаги", "Знаки и символы"),
    
    Question("В каком из этих алфавитов меньше всего букв?",OccupationEnum.litterateur,
             "Латинский", "Грузинский", "Армянский", "Греческий"),
    
    Question("Кто из этих богов и богинь не был сыном или дочерью Зевса?",OccupationEnum.litterateur,
             "Аполлон", "Афина", "Гермес", "Деметра"),
    
    Question("Чему дал название хвост петуха?",OccupationEnum.erudite,
             "стрижке панка", "букету гладиолусов", "детали токарного станка", "смеси напитков (коктейль)"),
    
    Question("В какой стране зародился стиль рококо?",OccupationEnum.historian,
             "Италия", "Австрия", "Испания", "Франция"),
    
    Question("Какая порода собак не существует?",OccupationEnum.biologist,
             "Керн-терьер", "Чешский терьер", "Силихем-терьер", "Монтефорт-терьер"),
    
    Question("Как в России в старину называли изумруд?",OccupationEnum.historian,
             "Карбункул", "Диамант", "Яхонт", "Смарагд"),
    
    Question("Из какого языка пришло слово 'алгебра'?",OccupationEnum.mathematician,
             "Греческого", "Санскрита", "Иврита", "Арабского"),
    
    Question("С каким философом Екатерина II вела дружескую переписку?",OccupationEnum.historian,
             "Декарт", "Руссо", "Паскаль", "Вольтер"),
    
    Question("Кто в юном возрастел был избран жрецом Юпитера и не имел права садится на коня?",OccupationEnum.historian,
             "Марк Антоний", "Гней Помпей", "Марк Аврелий", "Юлий Цезарь"),
    
    Question("Уравнение Максвелла относится к...",OccupationEnum.mathematician,
             "Классической механике", "Статике", "Квантовой механике", "Электромагнетизму"),
    
    Question("Какой буквой греческого алфавита обозначается отношение длины окружности к её диаметру?",OccupationEnum.mathematician,
             "Гамма", "Бета", "Альфа", "Пи", .level8, .level10),
    
    Question("Какая мышца в теле человека самая крупная?",OccupationEnum.biologist,
             "Грудная", "Икроножная", "Дельтовидная", "Ягодичная"),
    
    Question("Какой древнегреческий философ любил повторять: 'Я знаю, что ничего не знаю'?",OccupationEnum.litterateur,
             "Демокрит", "Эпикур", "Аристотель", "Сократ"),
    
    Question("На каком из этих спутников предполагают наличие жидких морей подо льдом?",OccupationEnum.erudite,
             "Ио", "Деймос", "Харон", "Европа"),
    
    Question("Где были изготовлены самые первые (из дошедших до нас) монеты?",OccupationEnum.historian,
             "Рим", "Шумер", "Израиль", "Лидия"),
    
    Question("Вождём какого племени был Монтесума?",OccupationEnum.historian,
             "Майя", "Инки", "Ирокезы", "Ацтеки"),
    
    Question("Какое отчество было у Пьера Безухова?",OccupationEnum.litterateur,
             "Александрович", "Константинович", "Владимирович", "Кириллович"),
    
    Question("Какая страна ежегодно дарит Великобритании к Рождеству роскошную ёлку?",OccupationEnum.erudite,
             "Финляндия", "Швеция", "Дания", "Норвегия"),
    
    Question("Король какой страны подарил Петру I Янтарную комнату?",OccupationEnum.historian,
             "Швеции", "Франции", "Дании", "Пруссии"),
    
    Question("Чего боится охлофоб?",OccupationEnum.erudite,
             "Змей", "Открытого пространства", "Наказания", "Толпы"),
    
    Question("Как звали царя, трое сыновей которого тоже стали русскими царями?",OccupationEnum.historian,
             "Михаил", "Фёдор", "Пётр", "Алексей"),
    
    Question("Выше какого здания Николай I запретил строить дома в Санкт-Петербурге?",OccupationEnum.historian,
             "Исаакиевский собор", "Смольный институт", "Адмиралтейство", "Зимний дворец"),
    
    Question("Кто такая золовка?",OccupationEnum.litterateur,
             "Сестра жены", "Жена брата", "Дочь крестной", "Сестра мужа"),
    
    Question("Кто из конкистадоров покорил империю инков?",OccupationEnum.historian,
             "Васко Нуньес де Бальбоа", "Эрнан Кортес", "Франсиско де Орельяна", "Франсиско Писарро"),
    
    Question("Что изучает колеоптеролог?",OccupationEnum.biologist,
             "Ископаемых птиц", "Змей", "Червей", "Жуков"),
    
    Question("От названия какой части ноги произошло английское слово 'футбол'?",OccupationEnum.sportReviewer,
             "голень", "колено", "бедро", "ступня"),
    
    Question("Каким было полное имя набоковской Лолиты?",OccupationEnum.litterateur,
             "Лора", "Лаура", "Элоиза", "Долорес"),
    
    Question("В какой стране в Средние века был впервые получен этиловый спирт?",OccupationEnum.biologist,
             "Россия", "Германия", "Франция", "Италия"),
    
    Question("На пьедестале чьего памятника высечены слова: 'Остановивший Солнце, сдвинувший Землю'?",OccupationEnum.historian,
             "Галилео Галилей", "Джордано Бруно", "Клавдий Птолемей", "Николай Коперник"),
    
    Question("Что означает название месяца октябрь?",OccupationEnum.litterateur,
             "жёлтый", "дождливый", "десятый", "восьмой"),
    
    Question("Какое море соединяется с Мраморным проливом Босфор?",OccupationEnum.geographer,
             "Адриатическое", "Эгейское", "Средиземное", "Черное"),
    
    Question("Какой плод на латыни называется 'армянской сливой'?",OccupationEnum.biologist,
             "алыча", "персик", "айва", "абрикос"),
    
    Question("Раньше в примитивных светильниках использовалось деревянное масло. Что это за масло?",OccupationEnum.historian,
             "Подсолнечное", "Льняное", "Рыбий жир", "Оливковое"),
    
    Question("Цветок какого растения ищут в ночь на Ивана Купалу?",OccupationEnum.litterateur,
             "Ландыша", "Маргаритки", "Можжевельника", "Папоротника"),
    
    Question("В племени масаев мальчик считается взрослым после того, как…",OccupationEnum.litterateur,
             "Обгонит гепарда", "остроит хижину", "Научится читать и писать", "Победит льва"),
    
    Question("Какие из перечисленных ягод созревают первыми?",OccupationEnum.biologist,
             "Брусника", "Голубика", "Черника", "Земляника"),
    
    Question("Самые высокие горы в мире находятся…",OccupationEnum.geographer,
             "В Америке", "В Европе", "В Австралии", "В Азии"),

    Question("Какого цвета кожа белого медведя?",OccupationEnum.biologist,
             "Серого", "Белого", "Розового", "Черного"),
    
    Question("Что такое «карамба»?",OccupationEnum.erudite,
             "щупальца каракатицы", "разбитая иномарка", "столица Караханидского государства", "испанское ругательство"),
    
    Question("Что любит каждый сибарит?",OccupationEnum.litterateur,
             "науку и образование", "физкультуру и спорт", "боль и унижение", "роскошь и удовольствие"),
    
    Question("Как заканчивается название пьесы Александра Островского «На всякого мудреца довольно…»?",OccupationEnum.litterateur,
             "остроты", "суеты", "ерунды", "простоты"),
    
    Question("Как называется река, на которой стоит город Уфа?",OccupationEnum.housewife,
             "Красная", "Синяя", "Зеленая", "Белая"),
    
    Question("На что надевают мюли?",OccupationEnum.housewife,
             "на глаза", "на уши", "на руки", "на ноги"),
    
    Question("Чемпионом России в каком виде спорта стал олимпийский чемпион по фигурному катанию Николай Панин-Коломенкин?",OccupationEnum.sportReviewer,
             "плавание", "бег на лыжах", "бег на коньках", "стрельба"),
    
    Question("Сколько литров молока уйдет на производство одного килограмма сыра?",OccupationEnum.housewife,
             "15", "20", "30", "10"),
    
    Question("С какой болью сравнил любовь поэт Герих Гейне?",OccupationEnum.housewife,
             "с головной", "с поясничной", "с фантомной", "с зубной"),
    
    Question("Что получило название 'Лондонский глаз'?",OccupationEnum.housewife,
             "чаша стадиона 'Уэмбли'", "куранты Биг-Бена", "пруд Гайд-парка", "колесо обозрения"),
    
    Question("Второй вариант композиции Элтона Джона 'Свеча на ветру' посвящен принцессе Диане. А кому посвящен первый?",OccupationEnum.housewife,
             "матери Терезе", "Эми Уайнхаус", "Майклу Джексону", "Мэрилин Монро"),
    
    Question("Как должны быть расположены два шара, чтобы игрок в русскую пирамиду назвал их 'зайцами'?",OccupationEnum.housewife,
             "у противоположных луз", "на расстоянии в полстола", "у противоположных бортов", "вплотную друг к другу"),
    
    Question("Как звали митрополита, чье имя породило фразеологизм 'филькина грамота'?",OccupationEnum.housewife,
             "Филарет", "Филимон", "Филидор", "Филипп"),
    
    Question("Какой роман рассказывает историю семьи Буэндиа?",OccupationEnum.housewife,
             "Гроздья гнева", "Лолита", "Поющие в терновнике", "Сто лет одиночества"),
    
    Question("Какую огромную фигуру художник Флорентин Хофман отправляет плавать в водоемах по всему миру?",OccupationEnum.housewife,
             "бумажный кораблик", "пустую бутылку", "Губку Боба", "резиновую утку"),
    
    Question("Что такое папская митра?",OccupationEnum.housewife,
             "деталь турбины", "сорт баклажанов", "разновидность парашюта", "морской моллюск"),
    
    Question("Что в СССР не носило названия 'Победа'?",OccupationEnum.housewife,
             "легковой автомобиль", "наручные часы", "орден", "телевизор"),
    
    Question("Как сейчас называется хлеб, который впервые испекла вдова генерала Тучкова в основанном ею же монастыре?",OccupationEnum.housewife,
             "московский", "дарницкий", "рижский", "бородинский"),
    
    Question("Что запирал затвор казенника?",OccupationEnum.housewife,
             "дверь продуктового склада", "ворота рыцарского замка", "емкость со спиртом", "ствол артиллерийского орудия"),
    
    Question("Без какого ингредиента не приготовить басму - популярное блюдо узбекской кухни?",OccupationEnum.housewife,
             "изюм", "тесто", "рис", "лук"),
    
    Question("Как ведет себя человек, чье поведение называют амикошонством?",OccupationEnum.housewife,
             "грубо и хамски", "надменно и высокомерно", "лживо и неискренне", "бесцеремонно и фамильярно"),
    
    Question("Кем был отец хоккеиста Павла Буре?",OccupationEnum.housewife,
             "футболистом", "хоккеистом", "часовщиком", "пловцом"),
    
    Question("Что означает название пустыни Намиб на языке народа нама?",OccupationEnum.housewife,
             "Место, где нет воды", "Место, куда не ходят", "Место за границей жизни", "Место, где ничего нет"),
    
    Question("Для чего необходимы папильотки?",OccupationEnum.housewife,
             "для засолки огурцов", "для заливки бетона", "для закалки стали", "для завивки волос"),
    
    Question("Кто из персонажей комедии 'Горе от ума' был военнослужащим?",OccupationEnum.housewife,
             "Фамусов", "Чацкий", "Молчалин", "Скалозуб"),
    
    Question("Какого инструмента нет в классическом струнном квартете?",OccupationEnum.housewife,
             "скрипки", "альта", "виолончели", "контрабаса"),
    
    Question("Какая деталь дизайна отличает все туфли в стиле мэри-джейн?",OccupationEnum.housewife,
             "перфорация", "острый носок", "каблук-шпилька", "перемычка"),
    
]


// https://teledama.ru/otvety-v-kto-hochet-stat-millionerom-za-3-11-2018.html



